[
	{
		"abstract":"This article analyzes the effect of imperfections in physically realizable memory. Motivated by the realization of a bit as a Brownian particle within a double well potential, we investigate the energetics of an erasure protocol under a Gaussian mixture model. We obtain sharp quantitative entropy bounds that not only give rigorous justification for heuristics utilized in prior works, but also provide a guide toward the minimal scale at which an erasure protocol can be performed. We also compare the results obtained with the mean escape times from double wells to ensure reliability of the memory. The article quantifies the effect of overlap of two Gaussians on the the loss of interpretability of the state of a one bit memory, the required heat dissipated in partially successful erasures and reliability of information stored in a memory bit",
		"pdflink": "journalArticles/talukdar2018analysis.pdf",
		"type": "journal",
		"catid": "Information, Statistical Mechanics",
		"publisher": "Multidisciplinary Digital Publishing Institute",
		"year": "2018",
		"pages": "749",
		"number": "10",
		"volume": "20",
		"journal": "Entropy",
		"author": ["Talukdar, Saurav", "Bhaban, Shreyas", "Melbourne, James","Salapaka, Murti"],
		"pubId": "talukdar2018analysis",
		"title": "Analysis of Heat Dissipation and Reliability in Information Erasure: A Gaussian Mixture Approach"
		},
	{
		"abstract":"Optical tweezers have enabled important insights into intracellular transport through the investigation of motor proteins, with their ability to manipulate particles at the microscale, affording femto newton force resolution. Its use to realize a constant force clamp has enabled vital insights into the behavior of motor proteins under different load conditions. However, the varying nature of disturbances and the effect of thermal noise pose key challenges to force regulation. Furthermore, often the main aim of many studies is to determine the motion of the motor and the statistics related to the motion, which can be at odds with the force regulation objective. In this paper, we propose a mixed objective H 2 /H ∞ optimization framework using a model-based design, that achieves the dual goals of force regulation and real-time motion estimation with quantifiable guarantees. Here, we minimize the H ∞ norm for the force regulation and error in step estimation while maintaining the H 2 norm of the noise on step estimate within user specified bounds. We demonstrate the efficacy of the framework through extensive simulations and an experimental implementation using an optical tweezer setup with live samples of the motor protein “kinesin”, where regulation of forces below 1 piconewton with errors below 10% is obtained while simultaneously providing real-time estimates of motor motion.",
		"pdflink": "journalArticles/bhaban2018single.pdf",
		"type": "journal",
		"catid": "optical tweezers, robust control",
		"publisher": "IEEE/ASME",
		"year": "2018",
		"pages": "1532--1542",
		"number": "4",
		"volume": "23",
		"journal": "IEEE/ASME Transactions on Mechatronics",
		"author": ["Bhaban, Shreyas", "Talukdar, Saurav", "Li, Mingang" ,"Hays, Thomas", "Seiler, Pete", "Salapaka, Murti"],
		"pubId": "bhaban2018single",
		"title": "Single Molecule Studies Enabled by Model-Based Controller Design"
		},
		{
		"abstract":"Many signal processing and decision making algorithms reported in contemporary literature characterize the performance of the proposed methods utilizing decision error rates. However there is significant need for strategies that provide quantitative assessment of the fidelity of decisions made by the algorithms. This paper develops novel techniques utilizing which fidelity measures can be assigned quantitatively on some prevalent signal detection algorithms. The developed fidelity measurement methods with the detection algorithms are employed for topography imaging utilizing dynamic mode atomic force microscope (AFM). The AFM is a versatile metrology tool for interrogating material at the nano-scale. In spite of its remarkable achievements, a key issue that remains largely unaddressed is the assessment of fidelity of the measurement data. The developed paradigm facilitates user specific priority for either detection of sample features with high decision confidence or on not missing detection of true features. The fidelity measures presented here are suitable for real-time implementation. A detailed comparative study is presented to characterize the proposed signal detection algorithms and fidelity measurement techniques under practical AFM applications. Comprehensive simulation and experimental data corroborate the effectiveness of proposed methods.",
		"pdflink": "journalArticles/ghosal2018fidelity.pdf",
		"type": "journal",
		"catid": "afm,nanotechnology",
		"publisher": "IEEE",
		"year": "2018",
		"pages": "52831--52842",
		"number": "",
		"volume": "6",
		"journal": "IEEE Access",
		"author": ["Ghosal, Sayan", "Salapaka, Murti"],
		"pubId": "ghosal2018fidelity",
		"title": "Fidelity measurement on signal detection algorithms with application to AFM imaging"
		},
	{
	"abstract":"This paper presents a distributed, robust, and optimal control architecture for a network of multiple dc–dc converters. The network of converters considered form a dc microgrid in order to regulate a desired dc bus voltage and meet prescribed time-varying power sharing criteria among different energy sources. Such coordinated microgrids provide an important framework for leveraging the benefits of distributed power generation and consumption. The proposed control design seamlessly accommodates communication architectures that range from the centralized to decentralized scenarios with graceful degradation of the performance with lessened communication ability. Moreover, the methods developed are applicable to the case where the desired proportion in which the sources provide the power varies with time. A distinguishing feature of the control design approach is that it regards the net load current as a disturbance signal, lending itself to tractable analysis with tools from the robust and optimal control theory. A quantifiable analysis of the closed-loop stability and the performance of the network of converters is performed; the analysis simplifies to studying the closed-loop performance of an equivalent single-converter system. The control approach is demonstrated through simulations and experiments.",
	"pdflink": "journalArticles/baranwal2018distributed.pdf",
	"type": "journal",
	"catid": "power systems, microgrids",
	"publisher": "IEEE",
	"year": "2018",
	"pages": "3082-3092",
	"number": "4",
	"volume": "66",
	"journal": "IEEE Transactions on Industrial Electronics",
	"author": ["Baranwal, Mayank", "Askarian, Alireza", "Salapaka, Srinivasa", "Salapaka, Murti"],
	"pubId": "baranwal2018distributed",
	"title": "Distributed architecture for robust and optimal control of dc microgrid"
	},
	{
		"abstract":"Methods for supporting grid frequency stabilization using widespread flexible load and DER are becoming essential as the portion of synchronous generation decreases. This article develops a framework for providing fast primary frequency response that leverages deferrable loads and DER coordinated using high-speed measurements in real time to ensure that local objectives are met. The framework is demonstrated in a residential-scale experiment with four household appliances and an inverter. The effectiveness of an example load management algorithm is demonstrated using three underfrequency anomaly test cases. The experimental data corroborates that in all cases, the entire coordinated response, from detection and measurement of a frequency anomaly to completed coordinated net-load response, is completed within 143 ms (about 8.5 cycles).",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/lundstrom2018fast.pdf",
		"type": "abstract",
		"catid": "Power System, primary frequency control",
		"publisher": "NREL",
		"year": "2018",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Lundstrom, Blake R" ,"Patel, Sourav", " Attree, Sandeep", "Salapaka, Murti V."],
		"pubId": "lundstrom2018fast",
		"title": "Fast Primary Frequency Response Using Coordinated DER and Flexible Loads: Framework and Residential-Scale Demonstration"
	},
	{
		"abstract":"Quantitative estimation of material properties covers important spectrum of applications of atomic force microscopy (AFM). Among the diverse operational modes of AFM, the dynamic mode of operation is particularly suitable for imaging soft materials. This work discusses some important techniques to estimate the surface mechanical properties of materials utilizing the dynamic mode AFM. The viewpoint of equivalent cantilevers is a key enabler for such approach which is also implicitly assumed in many studies reported in literature. Two different equivalent cantilever based approaches, namely, the steady state estimation of equivalent parameters (SEEP) and the recursive estimation of equivalent parameters (REEP) methods are discussed which enable researchers to characterize the local surface mechanical properties of materials. Performance comparison and trade-offs among the SEEP and REEP methods are presented. The REEP technique is a higher bandwidth estimation method compared to SEEP. However, the REEP method is computationally more complex compared to SEEP and requires significant effort to be implemented on real-time hardware. Thus, an overview of the design steps and architecture of a REEP module implemented on Field Programmable Gate Arrays (FPGA) is outlined. The step by step approach developed in this work can be used as recipe by AFM researchers to investigate materials of their interest with minimal customization of commercially available dynamic mode AFM setups.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/ghosal2018dynamic.pdf",
		"type": "abstract",
		"catid": "AFM, material characterization",
		"publisher": "",
		"year": "2018",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "International Scanning Probe Microscopy, 2018",
		"author": ["Ghosal, Sayan", "Salapaka, Murti"],
		"pubId": "ghosal2018dynamic",
		"title": "Dynamic mode atomic force microscopy toward characterizing material properties at nano-scale"
	},
	
	{
		"abstract":"Single molecular studies often enable estimations of parameters unobservable in bulk studies. In particular, single molecule force spectroscopy is well recognized for its potential in understanding biomolecules since many biological functions are known to be a result of the physical interactions of molecules. The atomic force microscope (AFM) is a powerful tool for force spectroscopy because it can be used to apply and measure forces ranging from pico to nano newtons, under diverse conditions such as under liquids, at physiologically relevant temperatures, and with little or no modifications to the samples being studied. Force spectroscopy using AFMs involves using a feedback control system to apply a controlled tensile force on a single biomolecule attached between the tip of an AFM cantilever and a substrate. The applied force may be held at a constant value or increased linearly in a ramp. The data from the experiments are then analyzed assuming that the force on the molecule was indeed a true constant or a perfect ramp. Thus, accuracy and reliability of the parameters estimated are dependent on the feedback controller’s ability to maintain the applied force close to the desired setpoint. The design of a force controller is made complicated by many factors. Besides the noise added via the AFM’s electronics, the measurements for feedback are subject to the thermal oscillations of the AFM cantilevers and biomolecules. In addition, the stiffness of the biomolecules changes with extension (and thus the applied force). This can be observed from the frequently used worm like chain (WLC) model used to describe the force-extension characteristics of biomolecules. This change in stiffness implies a change in the open loop gain of the system to be controlled. Further, biomolecules may undergo sudden and drastic structural changes under tension. For example, many protein molecules consist of folded domains that unfold under tension, leading to a sudden increase in their contour lengths, and hence a decrease in the stiffness. In order to address these challenges, we propose a robust force control design for the application of AFM based single molecule force spectroscopy. This would ensure consistent performance under the changing conditions of the force spectroscopy experiments. Moreover, such a controller would be reusable across a wider range of biomolecules without the need for retuning the controller, enabling a greater level of automation of single molecule experiments. This robust control system would be validated on the reference protein titin and applied to study utrophin and dystrophin, whose characterization is important for understanding muscular dystrophy.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/rajaganapathy2018robust.pdf",
		"type": "abstract",
		"catid": "robust control, AFM, protein, force clamp",
		"publisher": "",
		"year": "2018",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "International Scanning Probe Microscopy, 2018",
		"author": ["Rajaganapathy, Sivaraman","Shrivastava, Rachit","Jaro, Jackson", "Ghosal, Sayan", "Salapaka, Murti"],
		"pubId": "rajaganapathy2018robust",
		"title": "Robust Control for Single Molecule Force Spectroscopy"
	},
	
	
	{
		"abstract": "In this article, we present a method to reconstruct the topology of a partially observed radial network of linear dynamical systems with bi-directional interactions. Our approach exploits the structure of the inverse power spectral density matrix and recovers edges involving nodes up to four hops away in the underlying topology. We then present an algorithm with provable guarantees, which eliminates the spurious links obtained and also identifies the location of the unobserved nodes in the inferred topology. The algorithm recovers the exact topology of the network by using only time-series of the states at the observed nodes. The effectiveness of the method developed is demonstrated by applying it on a typical distribution system of the electric grid.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/talukdar2018topology.pdf",
		"type": "conference",
		"catid": "theory, networks, power systems",
		"publisher": "",
		"year": "2018",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "American Control Conference (ACC), 2018 (Accepted)",
		"author": ["Talukdar, Saurav", "Deka, Deepjyoti", "Chertkov, Michael", "Salapaka, Murti V"],
		"pubId": "talukdar2018topology",
		"title": "Topology Learning of Radial Dynamical Systems with Latent Nodes"
	},	
	
	{
		"abstract":"Data analysis in single molecule studies often involves estimation of parameters and the detection of abrupt changes in measured signals. For single molecule studies, tools for automated analysis that are crucial for rapid progress, need to be effective under large noise magnitudes, and often must assume little or no prior knowledge of parameters being studied. This article examines an iterated, dynamic programming based step detection algorithm (SDA). It is established that given a prior estimate, an iteration of the SDA necessarily improves the estimate. The analysis provides an explanation and a confirmation of the effectiveness of the learning and estimation capabilities of the algorithm observed empirically. Further, an alternative application of the SDA is demonstrated, wherein the parameters of a worm-like chain (WLC) model are estimated, for the automated analysis of data from single molecule protein pulling experiments.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/rajaganapathy2018learning.pdf",
		"type": "conference",
		"catid": "theory, learning, step fit, single molecule studies, AFM, protein",
		"publisher": "",
		"year": "2018",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "American Control Conference (ACC), 2018 (Accepted)",
		"author": ["Rajaganapathy, Sivaraman","Melbourne, James","Aggarwal, Tanuj","Shrivastava, Rachit,", "Salapaka, Murti V"],
		"pubId": "rajaganapathy2018learning",
		"title": "Learning and Estimation of Single Molecule Behavior"
	},
	
	{
		"abstract":"Landauer's bound states that succesful erasure of a bit of information results in an average dissipation of at least kTln 2. We analyze the effect of 'imperfections' on the minimum heat dissipation associated with a quasi static erasure of a bit of information. Two types of imperfections are considered - overlap between the two states which define a bit of memory and the asymmetry between the two states of a bit of memory. We conclude that, the two types of imperfections presented could lower the heat dissipation associated with erasure of a bit of information as compared to the Landauer's bound.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/talukdar2018mixture.pdf",
		"type": "conference",
		"catid": "theory, information theory, Landauer",
		"publisher": "",
		"year": "2018",
		"pages": "",
		"number": "Y47.00009",
		"volume": "",
		"journal": "Bulletin of the American Physical Society (2018)",
		"author": ["Talukdar, Saurav","Bhaban, Shreyas","Melbourne, James", "Salapaka, Murti"],
		"pubId": "talukdar2018mixture",
		"title": "Mixture of Gaussians perspective on the Landauer Bound"
	},
	
	{
		"abstract":"In this article, we investigate the entropy of a sum of a discrete and a continuous random variable. Bounds for estimating the entropy of the sum are obtained for the cases when the continuous random variable is Gaussian or log-concave. Bounds on the capacity of a channel where the discrete random variable is the input and the output is the input corrupted by additive noise modeled by the continuous random variable are obtained. The bounds are shown to be sharp in the case that the discrete variable is Bernoulli.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/melbourne2018deficit.pdf",
		"type": "conference",
		"catid": "information theory, theory, probability",
		"publisher": "",
		"year": "2018",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "arXiv preprint arXiv:1805.11257",
		"author": ["Melbourne, James","Talukdar, Saurav","Bhaban, Shreyas", "Salapaka, Murti V"],
		"pubId": "melbourne2018deficit",
		"title": "The deficit in an entropic inequality"
	},
	
	{
		"abstract":"The science of system identification is widely utilized in modeling input-output relationships of diverse systems. In this article, we report field programmable gate array (FPGA) based implementation of a real-time system identification algorithm which employs forgetting factors and bias compensation techniques. The FPGA module is employed to estimate the mechanical properties of surfaces of materials at the nano-scale with an atomic force microscope (AFM). The FPGA module is user friendly which can be interfaced with commercially available AFMs. Extensive simulation and experimental results validate the design.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/ghosal2018designof.pdf",
		"type": "journal",
		"catid": "instruments, AFM, FPGA, system identification",
		"publisher": "AIP",
		"year": "2018",
		"pages": "056103",
		"number": "5",
		"volume": "89",
		"journal": "Review of Scientific Instruments",
		"author": ["Ghosal, Sayan","Pradhan, Sourav", "Salapaka, Murti"],
		"pubId": "ghosal2018designof",
		"title": "Note: Design of FPGA based system identification module with application to atomic force microscopy"
	},
	
	
	{
		"abstract":"The Landauer's Principle states that information erasure will be accompanied by heat dissipation of at least kb Tln 2 per bit, where kb is the Boltzmann constant and T is the temperature. The bound is significant, as it establishes a physical limitation on the improvement modern day electronic switches in terms of size and efficiency. Our analysis adds to the handful of existing studies that have demonstrated an experimental and computational validation of Landauer's Bound. Utilizing optical tweezers, we model a one-bit memory as a Brownian particle in a double well potential and propose a novel method to erase it, based on manipulation of the optical traps. We quantify the heat dissipation in erasing the memory by resorting to 'stochastic thermodynamics' framework for Langevin systems developed by Sekimoto. Using extensive Monte Carlo simulations and experiments we demonstrate that the lower bound for average heat dissipation, per erased bit, is achieved thereby validating Landauer's claim. Thus, we present an independent verification of Landauer's principle, further enforcing the fundamental link between Thermodynamics and Information Theory.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/talukdar2017verification.pdf",
		"type": "abstract",
		"catid": "theory, Landauer, optical tweezers",
		"publisher": "",
		"year": "2017",
		"pages": "",
		"number": "V15.002",
		"volume": "",
		"journal": "APS March Meeting Abstracts",
		"author": ["Talukdar, Saurav","Bhaban, Shreyas","Salapaka, Murti"],
		"pubId": "talukdar2017verification",
		"title": "Verification of Landauer's Principle using Optical Fields"
	},
	
	{
		"abstract":"The article revisits Aizerman and Kalman conjectures for absolute stability through the lens of a novel graphical interpretation. Even though these conjectures are false in the general case, such a graphical interpretation suggests natural ways to introduce additional conditions in order to obtain valid absolute stability criteria. As an illustration, the article proves a new absolute stability criterion obtained by the iterative application of a variation of the circle criterion.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/naderi2017kalman.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "IEEE",
		"year": "2017",
		"pages": "523-528",
		"number": "",
		"volume": "",
		"journal": "Decision and Control (CDC), 2017 IEEE 56th Annaual Conference on.",
		"author": ["Naderi, Taher","Materassi, Donatello","Innocenti, Giacomo", "Genesio, Roberto", "Salapaka, Murti"],
		"pubId": "naderi2017kalman",
		"title": "Revisiting Kalman and Aizerman conjectures"
	},
	
	{
		"abstract":"The interconnectivity structure of many complex systems can be modeled as a network of dynamically interacting processes. Identification of mutual dependencies amongst the agents is of primary importance in many application domains that include internet-of-things, neuroscience and econometrics. Moreover, in many such systems it is not possible to deliberately affect the system and thus passive methods are of particular relevance. However, for an effective framework that identifies influence pathways from dynamically related data streams originating at different sources it is essential to address the uncertainty of data caused by possibly unknown time-origins of different streams and other corrupting influences including packet drops and noise. In this article, a method of reconstructing the network topology from corrupt data streams is provided with emphasis on the characterization of the effects of data corruption on the reconstructed network. The structure of the network is identified by observing the sparsity pattern in the joint power spectrum of the measurements.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/subramanian2017network.pdf",
		"type": "conference",
		"catid": "networks, theory",
		"publisher": "IEEE",
		"year": "2017",
		"pages": "1695-1700",
		"number": "",
		"volume": "",
		"journal": "Decision and Control (CDC), 2017 IEEE 56th Annaual Conference on.",
		"author": ["Subramanian, Venkat Ram","Lamperski, Andrew", "Salapaka, Murti V"],
		"pubId": "subramanian2017network",
		"title": "Network topology identification from corrupt data streams"
	},
	
	{
		"abstract":"This paper addresses the problem of output voltage regulation for multiple DC/DC converters connected to a microgrid, and prescribes a scheme for sharing power among different sources. This architecture is structured in such a way that it admits quantifiable analysis of the closed-loop performance of the network of converters; the analysis simplifies to studying closed-loop performance of an equivalent single-converter system. The proposed architecture allows for the proportion in which the sources provide power to vary with time; thus overcoming limitations of our previous designs. Additionally, the proposed control framework is suitable to both centralized and decentralized implementations, i.e., the same control architecture can be employed for voltage regulation irrespective of the availability of common load-current (or power) measurement, without the need to modify controller parameters. The performance becomes quantifiably better with better communication of the demanded load to all the controllers at all the converters (in the centralized case); however guarantees viability when such communication is absent. Case studies comprising of battery, PV and generic sources are presented and demonstrate the enhanced performance of prescribed optimal controllers for voltage regulation and power sharing.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/baranwal2017robust.pdf",
		"type": "conference",
		"catid": "theory, robust control, power systems, microgrids",
		"publisher": "IEEE",
		"year": "2017",
		"pages": "1413-1418",
		"number": "",
		"volume": "",
		"journal": "American Control Conference (ACC), 2017",
		"author": ["Baranwal, Mayank","Askarian, Alireza","Salapaka, Srinivasa M", "Salapaka, Murti"],
		"pubId": "baranwal2017robust",
		"title": "A robust scheme for distributed control of power converters in DC microgrids with time-varying power sharing"
	},		
	
	{
		"abstract":"Intracellular transport of cargoes, such as organelles, are enabled by nano-scale bio-mechanical agents called 'motor proteins', which attach to the cargo and transport it to their destination by 'walking' over filaments. The motors carry cargoes against load forces that are less than their characteristic 'stalling force'. Often transport is mediated by teams of motors, possibly of the same or different types. We develop a semi-analytical method to analyze the emergent transport properties of motor ensembles, by investigating the relative arrangements of motors while carrying a cargo. Study reveals that the relative configurations approach a unique steady state distribution, enforcing the robustness of the motor-cargo assembly. As the load on the cargo increases, motors tend to cluster together. Under high loads, akin to sudden obstacles, motors assume configurations that favor immediate cargo translocation when the load eventually subsides. Furthermore, participation by motors with varying stall forces reveals surprising results. Results indicate that a minority of motors with altered stall forces can determine average run-length and velocity of the cargo. Such mutations are related to neurological disorders, providing a potential insight into the onset of neuro-degeneration.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/bhaban2017analysis.pdf",
		"type": "abstract",
		"catid": "molecular motors, theory, biology, intra-cellular transport",
		"publisher": "",
		"year": "2017",
		"pages": "",
		"number": "C4.010",
		"volume": "",
		"journal": "APS March Meeting Abstracts",
		"author": ["Bhaban, Shreyas","Talukdar, Saurav","Materassi, Donatello", "Li, Mingang", "Hays, Thomas", "Salapaka, Murti"],
		"pubId": "bhaban2017analysis",
		"title": "Analysis of Intracellular Transport by Teams of Molecular Motors"
	},
	
	{
		"abstract": "Intracellular transport is an essential function in eucaryotic cells, facilitated by motor proteins—proteins converting chemical energy into kinetic energy. It is understood that motor proteins work in teams enabling unidirectional and bidirectional transport of intracellular cargo over long distances. Disruptions of the underlying transport mechanisms, often caused by mutations that alter single motor characteristics, are known to cause neurodegenerative diseases. For example, phosphorylation of kinesin motor domain at the serine residue is implicated in Huntington’s disease, with a recent study of phosphorylated and phosphomimetic serine residues indicating lowered single motor stalling forces. In this article we report the effects of mutations of this nature on transport properties of cargo carried by multiple wild-type and mutant motors. Results indicate that mutants with altered stall forces might determine the average velocity and run-length even when they are outnumbered by wild type motors in the ensemble. It is shown that mutants gain a competitive advantage and lead to an increase in the expected run-length when the load on the cargo is in the vicinity of the mutant’s stalling force or a multiple of its stalling force. A separate contribution of this article is the development of a semi-analytic method to analyze transport of cargo by multiple motors of multiple types. The technique determines transition rates between various relative configurations of motors carrying the cargo using the transition rates between various absolute configurations. This enables a computation of biologically relevant quantities like average velocity and run-length without resorting to Monte Carlo simulations. It can also be used to introduce alterations of various single motor parameters to model a mutation and to deduce effects of such alterations on the transport of a common cargo by multiple motors. Our method is easily implementable and we provide a software package for general use.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/bhaban2016interrogating.pdf",
		"type": "journal",
		"catid": "optical tweezers, molecular motors, theory, software, biology",
		"publisher": "Public Library of Science",
		"year": "2016",
		"pages": "e1005152",
		"number": "11",
		"volume": "12",
		"journal": "PLoS computational biology",
		"author": ["Bhaban, Shreyas","Materassi, Donatello","Li, Mingang", "Hays, Thomas", "Salapaka, Murti"],
		"pubId": "bhaban2016interrogating",
		"title": "Interrogating emergent transport properties for molecular motor ensembles: A semi-analytical approach"
	},
	 {
		"abstract": "In this article, we explore methods that enable estimation of material properties with the dynamic mode atomic force microscopy suitable for soft matter investigation. The article presents the viewpoint of casting the system, comprising of a flexure probe interacting with the sample, as an equivalent cantilever system and compares a steady-state analysis based method with a recursive estimation technique for determining the parameters of the equivalent cantilever system in real time. The steady-state analysis of the equivalent cantilever model, which has been implicitly assumed in studies on material property determination, is validated analytically and experimentally. We show that the steady-state based technique yields results that quantitatively agree with the recursive method in the domain of its validity. The steady-state technique is considerably simpler to implement, however, slower compared to the recursive technique. The parameters of the equivalent system are utilized to interpret storage and dissipative properties of the sample. Finally, the article identifies key pitfalls that need to be avoided toward the quantitative estimation of material properties.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/ghosal2017quantitative.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "IOP Publishing",
		"year": "2017",
		"pages": "325703",
		"number": "32",
		"volume": "28",
		"journal": "Nanotechnology",
		"author": ["Ghosal, Sayan", "Gannepalli, Anil", "Salapaka, Murti V"],
		"pubId": "ghosal2017quantitative",
		"title": "Toward quantitative estimation of material properties with dynamic mode atomic force microscopy: a comparative study"
	}, 
	{
		"abstract": "Estimation of the operational topology of the power grid is necessary for optimal market settlement and reliable dynamic operation of the grid. This paper presents a novel framework for topology estimation for general power grids (loopy or radial) using time-series measurements of nodal voltage phase angles that arise from the swing dynamics. Our learning framework utilizes multivariate Wiener filtering to unravel the interaction between fluctuations in voltage angles at different nodes and identifies operational edges by considering the phase response of the elements of the multivariate Wiener filter. The performance of our learning framework is demonstrated through simulations on standard IEEE test cases.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/talukdar2017learning.pdf",
		"type": "conference",
		"catid": "power systems",
		"publisher": "ACM",
		"year": "2017",
		"pages": "222-227",
		"number": "",
		"volume": "",
		"journal": "Proceedings of the Eighth International Conference on Future Energy Systems",
		"author": ["Talukdar, Saurav", "Deka, Deepjyoti", "Lundstrom, Blake", "Chertkov, Michael", "Salapaka, Murti V"],
		"pubId": "talukdar2017learning",
		"title": "Learning Exact Topology of a Loopy Power Grid from Ambient Dynamics"
	}, 
	{
		"abstract": "In this article, we present a method to learn the interaction topology of a network of agents undergoing linear consensus updates in a non invasive manner. Our approach is based on multivariate Wiener filtering, which is known to recover spurious edges apart from the true edges in the topology. The main contribution of this work is to show that in the case of undirected consensus networks, all spurious links obtained using Wiener filtering can be identified using frequency response of the Wiener filters. Thus, the exact interaction topology of the agents is unveiled. The method presented requires time series measurements of the state of the agents and does not require any knowledge of link weights. To the best of our knowledge this is the first approach that provably reconstructs the structure of undirected consensus networks with correlated noise. We illustrate the effectiveness of the method developed through numerical simulations as well as experiments on a five node network of Raspberry Pis.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/talukdar2017learningexact.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2017",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "arXiv preprint arXiv:1710.00032",
		"author": ["Talukdar, Saurav", "Deka, Deepjyoti", "Attree, Sandeep", "Materassi, Donatello", "Salapaka, Murti V"],
		"pubId": "talukdar2017learningexact",
		"title": "Learning the Exact Topology of Undirected Consensus Networks"
	}, 
	{
		"abstract": "Greater penetration of Distributed Energy Resources (DERs) in power networks requires coordination strategies that allow for self-adjustment of contributions in a network of DERs, owing to variability in generation and demand. In this article, a distributed scheme is proposed that enables a DER in a network to arrive at viable power reference commands that satisfies the DERs local constraints on its generation and loads it has to service, while, the aggregated behavior of multiple DERs in the network and their respective loads meet the ancillary services demanded by the grid. The Net-load Management system for a single unit is referred to as the Local Inverter System (LIS) in this article . A distinguishing feature of the proposed consensus based solution is the distributed finite time termination of the algorithm that allows each LIS unit in the network to determine power reference commands in the presence of communication delays in a distributed manner. The proposed scheme allows prioritization of Renewable Energy Sources (RES) in the network and also enables auto-adjustment of contributions from LIS units with lower priority resources (non-RES). The methods are validated using hardware-in-the-loop simulations with Raspberry PI devices as distributed control units, implementing the proposed distributed algorithm and responsible for determining and dispatching realtime power reference commands to simulated power electronics interface emulating LIS units for demand response.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/patel2017distributed.pdf",
		"type": "conference",
		"catid": "power systems",
		"publisher": "IEEE",
		"year": "2017",
		"pages": "38-44",
		"number": "",
		"volume": "",
		"journal": "Smart Grid Communications (SmartGridComm), 2017 IEEE International Conference on",
		"author": ["Patel, Sourav", "Attree, Sandeep" , "Talukdar, Saurav", "Prakash, Mangal", "Salapaka, Murti V"],
		"pubId": "patel2017distributed",
		"title": "Distributed Apportioning in a Power Network for providing Demand Response Services"
	}, 
	{
		"abstract": "The topology of a power grid affects its dynamic operation and settlement in the electricity market. Real-time topology identification can enable faster control action following an emergency scenario like failure of a line. This article discusses a graphical model framework for topology estimation in bulk power grids (both loopy transmission and radial distribution) using measurements of voltage collected from the grid nodes. The graphical model for the probability distribution of nodal voltages in linear power flow models is shown to include additional edges along with the operational edges in the true grid. Our proposed estimation algorithms first learn the graphical model and subsequently extract the operational edges using either thresholding or a neighborhood counting scheme. For grid topologies containing no three-node cycles (two buses do not share a common neighbor), we prove that an exact extraction of the operational topology is theoretically guaranteed. This includes a majority of distribution grids that have radial topologies. For grids that include cycles of length three, we provide sufficient conditions that ensure existence of algorithms for exact reconstruction. In particular, for grids with constant impedance per unit length and uniform injection covariances, this observation leads to conditions on geographical placement of the buses. The performance of algorithms is demonstrated in test case simulations.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/deka2017topology.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2017",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "Bulk Power Systems Dynamics and Control Symposium-IREP. 2017",
		"author": ["Dekay, Deepjyoti", "Talukdar, Saurav", "Chertkov, Michael", "Salapaka, Murti V"],
		"pubId": "deka2017topology",
		"title": "Topology estimation in bulk power grids: Guarantees on exact recovery"
	}, 
	{
		"abstract": "The Landauer’s Principle, proposed by Rolf Landauer in 1961, states that the logically irreversible operation of erasing a single bit of information requires atleast kbT ln 2 amount of energy, kb and T being Boltzmann’s constant and temperature respectively. However, Landauer’s bound holds only for erasure mechanisms that are perfect. In this article we investigate the effect of imperfections in erasure mechanisms. If the proportion of successful erasures is quantified by p, we show that the minimum energy needed to erase a bit of information is given by kbT[ln 2 + p ln p + (1 - p) ln (1 - p)], also known as the Generalized Landauer bound. Furthermore, we provide a mechanism for realizing a memory bit by multiplexing an optical trap rapidly and propose a mechanism of erasure, for various success proportions p. Using our framework, we show using Monte Carlo simulations that heat dissipation lower than the Landauer’s bound is achievable by reducing p. Thus, we establish an independent method of beating Landauer’s bound by resorting to partially successful erasures.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/talukdar2017beatinglandauer.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "Elsevier",
		"year": "2017",
		"pages": "7645-7650",
		"number": "1",
		"volume": "50",
		"journal": "",
		"author": ["Talukdar, Saurav", "Bhaban, Shreyas", "Salapaka, Murti V"],
		"pubId": "talukdar2017beatinglandauer",
		"title": "Beating Landauer’s bound by Memory Erasure using Time Multiplexed Potentials"
	}, 	
	{
		"abstract": "In this article we present a method to reconstruct the interconnectedness of dynamically related stochastic processes, where the interactions are bi-directional and the underlying topology is a tree. Our approach is based on multivariate Wiener filtering which recovers spurious edges apart from the true edges in the topology reconstruction. The main contribution of this work is to show that all spurious links obtained using Wiener filtering can be eliminated if the underlying topology is a tree based on which we present a three stage network reconstruction procedure for trees. We illustrate the effectiveness of the method developed by applying it on a typical distribution system of the electric grid.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/talukdar2017exacttopology.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "IEEE",
		"year": "2017",
		"pages": "813 - 818",
		"number": "",
		"volume": "",
		"journal": "American Control Conference (ACC), 2017",
		"author": ["Talukdar, Saurav", "Deka, Deepjyoti", "Materassi, Donatello", "Salapaka, Murti V"],
		"pubId": "talukdar2017exacttopology",
		"title": "Exact topology reconstruction of radial dynamical systems with applications to distribution system of the power grid"
	}, 	
	{
		"abstract": "We study the thermodynamics of a Brownian particle under the influence of a time-multiplexed harmonic potential of finite width. The memory storage mechanism and the erasure protocol based on time-multiplexed potentials are utilized to experimentally realize erasure with work performed close to Landauer’s bound. We quantify the work performed on the system with respect to the duty ratio of time multiplexing, which also provides a handle for approaching reversible erasures. A Langevin dynamics based simulation model is developed for the proposed memory bit and the erasure protocol, which guides the experimental realization. The study also provides insight into transport on the microscale.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/talukdar2017memory.pdf",
		"type": "journal",
		"catid": "theory",
		"publisher": "American Physical Society",
		"year": "2017",
		"pages": "062121",
		"number": "6",
		"volume": "95",
		"journal": "Physical Review E",
		"author": ["Talukdar, Saurav","Bhaban, Shreyas", "Salapaka, Murti V"],
		"pubId": "talukdar2017memory",
		"title": "Memory erasure using time-multiplexed potentials"
	}, 
	{
		"abstract": "This paper addresses the problem of output voltage regulation for multiple DC-DC converters connected to a grid, and prescribes a robust scheme for sharing power among different sources. Also it develops a method for sharing 120 Hz ripple among DC power sources in a prescribed proportion, which accommodates the different capabilities of DC power sources to sustain the ripple. We present a decentralized control architecture, where a nested (inner-outer) control design is used at every converter. An interesting aspect of the proposed design is that the analysis and design of the entire multi-converter system can be done using an equivalent single converter system, where the multi-converter system inherits the performance and robustness achieved by a design for the single-converter system. Another key aspect of this work is that the voltage regulation problem is addressed as a disturbance-rejection problem, where {\\em unknown} load current is viewed as an external signal, and thus, no prior information is required on the nominal loading conditions. The control design is obtained using robust optimal-control framework. Case studies presented show the enhanced performance of prescribed optimal controllers.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/baranwal2016robust.pdf",
		"type": "conference",
		"catid": "power systems",
		"publisher": "",
		"year": "2016",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "arXiv preprint arXiv:1604.03573",
		"author": ["Baranwal, Mayank", "Salapaka, Srinivasa M", "Salapaka, Murti V"],
		"pubId": "baranwal2016robust",
		"title": "Robust decentralized voltage control of dc-dc converters with applications to power sharing and ripple sharing"
	}, {
		"abstract": "Transport at the micro scale is an essential aspect for many emerging areas including manufacturing systems at the nanoscale. Transfer of beads decorated with cargo under the influence of optical fields provide an attractive means of such transport. Physical models that describe beads in optical fields under the influence of thermal noise are available which yield a qualitative understanding of the bead motion; however, it is difficult to arrive at models that provide quantitative agreement. The first contribution of the article is the determination of a model of a bead under a static field realized by optical forces where the model can be used to predict the motion of the bead under a time-varying optical potential with high fidelity. Close agreement between model based Monte Carlo simulations and experimental observations is seen. The other contribution is a strategy for directed transport of micron-sized particles that utilizes the proposed models to arrive at conclusions which are experimentally verified and easy to implement. The effectiveness of this transport mechanism is justified based on splitting probability computations. Applications to transport of cargo across multiple locations and transport of multiple cargo are experimentally demonstrated.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/bhaban2016noise.pdf",
		"type": "conference",
		"catid": "optical tweezer",
		"publisher": "",
		"year": "2016",
		"pages": "5823-5829",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Bhaban, Shreyas", "Talukdar, Saurav", "Salapaka, Murti"],
		"pubId": "bhaban2016noise",
		"title": "Noise induced transport at microscale enabled by optical fields"
	}, {
		"abstract": "Summary form only given; The talk tackles the problem of reconstructing the tree-like topological structure of a network of linear dynamical systems. A distance function is defined in order to evaluate the �closeness� of two processes and some useful mathematical properties are derived. Theoretical results to guarantee the correctness of the identification procedure for networked linear systems characterized by a tree topology are provided as well. The talk also suggests the approximation of a complex connected network with a tree in order to detect the most meaningful interconnections.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/materassi2016fully.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2016",
		"pages": "4676-4676",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Materassi, Donatello", "Salapaka, Murti V"],
		"pubId": "materassi2016fully",
		"title": "Fully observable networks with polytree structure"
	}, {
		"abstract": "Summary form only given. Thermal noise has a significant effect on the functionality of the processes and matter at the molecular and smaller scales. Rational control and interrogation of matter at such small scales necessitates devices which have exquisite resolution to discern the signals where the measurement noise introduced cannot overwhelm the thermal response of matter. In this tutorial, methods that have evolved for rational control and interrogation of matter at the small scale will be explained with specific emphasis on the use of flexure probes and optical forces. In particular biological molecules will be used as a case study with emphasis on motor-proteins based transport inside cells and protein folding and unfolding experiments using flexure probes. Modern control theory and related perspectives hold significant promise in meeting the resolution and band-width needs for interrogation and manipulation of matter at the small scale. In the tutorial, examples on how such methods have overcome perceived limitations will be emphasized. Moreover, the tutorial will highlight avenues for future research and will outline outstanding challenges. The tutorial will be apt for researchers with background in controls; no expertise will be assumed on molecular scale aspects.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/materassi2016methods.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2016",
		"pages": "3092-3092",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Salapaka, Murti", "Salapaka, Srinivasa M"],
		"pubId": "salapaka2016gleaning",
		"title": "Gleaning signals from noise for probing matter at the molecular scale"
	}, {
		"abstract": "Summary form only given. The paper tackles the problem of identifying an individual transfer function in a network of linear dynamical systems in the presence of loops under the assumptions that (i) only a subset of the nodes is observable, and (ii) data are being passively recorded (i.e. it is not possible to intervene on any part of the system by actively injecting an input). Such a scenario is often encountered in the study of many naturally occurring systems and is also motivated by operating networked systems where the injection of an external signal might lead to undesired disruptions. Sufficient conditions on which signals should be observable to guarantee the identifiability of a desired link are provided. The enabling result is the fact that the notion of d-separation for graphs (see [1], [2]) implies a notion of independence for networks of linear dynamical systems as well [3], allowing one to import identification methodologies developed in different areas. This talk exemplifies how to import methodologies from the domain of graphical models to solve control and identification problems.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/materassi2016methods.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2016",
		"pages": "4680-4680",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Materassi, Donatello", "Salapaka, Murti V"],
		"pubId": "materassi2016methods",
		"title": "Methods for network identification robust with respect to uncertainties in a topology"
	}, {
		"abstract": "Summary form only given. The paper deals with the problem of unveiling the link structure of a network of linear dynamical systems. A technique is provided guaranteeing an exact detection of the links of a network of dynamical systems with no undirected cycles (Linear Dynamic Polytrees). In particular, the presence of unobserved (latent) nodes is taken into account. Knowledge on the specific number of hidden processes is not required. It is proven that the topology can be consistently reconstructed, as long the degree of each latent node is at least three with outdegree of at least two. The result extends previous work that was limited to a more restricted class of dynamical systems (Rooted Trees).",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/materassi2016partially.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2016",
		"pages": "4677-4677",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Materassi, Donatello", "Salapaka, Murti V"],
		"pubId": "materassi2016partially",
		"title": "Partially observable networks with polytree structure"
	}, {
		"abstract": "Imaging and manipulating objects down to the molecular level plays a crucial role in many disciplines. It allows to unravel molecular phenomena, to form materials with new chemical and physical properties, or to build objects on an atomic scale. Science on the nanoscale is inherently interdisciplinary. It requires knowledge and insight into many fields, spanning from modeling, measuring, imaging, actuation to control. Often feedback control facilitates operation with molecular precision, despite the fact that many physical phenomena at the molecular level are still not well understood, and that stochastic and nonlinear effects are inherently present. This work provides an insight into some of the current control related research activities on a molecular scale. This is done considering examples from different fields: control related to scanning probe microscopy such as atomic force microscopy, controlled self assembly on a molecular scale, control aspects of molecular transport, and the use of control for manipulation of single molecules using macroscopic probe tips. The hope is that control related researchers, who are not experts in these fields, become aware of the opportunities present, which could also drive new theoretical developments.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/findeisen2016control.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2016",
		"pages": "3069-3082",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Findeisen, Rolf", "Grover, Martha A", "Wagner, Christian", "Maiworm, Michael", "Temirov, Ruslan", "Tautz, F Stefan", "Salapaka, Murti V", "Salapaka, Srinivasa", "Braatz, Richard D", "Moheimani, SO Reza"],
		"pubId": "findeisen2016control",
		"title": "Control on a molecular scale: A perspective"
	}, {
		"abstract": "Detection of a model from a set of models that best describes the behavior of a system is of primary importance in many applications. In this article two discriminating signals are derived from measurements for a plant that switches between two model behaviors, where the transfer functions from inputs to the two signals are identical when one model is effective while they are negative of each other when the other model is effective. The developed detection algorithm called the innovation squared mismatch is utilized for the read operation of probe based data storage. The innovations squared mismatch method offers better detection performance with significantly less computational complexity compared to prevalently used maximum a posteriori probability based methods in current data storage systems. The article further proposes employing maximum likelihood sequence detection based methods where the plant behavior can switch from one model to another at high rates and the transients from a previous behavior affect the current behavior causing inter-symbol interference. Exhaustive simulation and experimental results corroborate the efficiency of the proposed methods.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/ghosal2016model.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "Elsevier",
		"year": "2016",
		"pages": "171-182",
		"number": "",
		"volume": "74",
		"journal": "Automatica",
		"author": ["Ghosal, Sayan", "Saraswat, Govind", "Salapaka, Murti"],
		"pubId": "ghosal2016model",
		"title": "Model detection with application to probe based data storage"
	}, {
		"abstract": "Atomic force microscopy is widely employed for imaging material at the nanoscale. However, real-time measures on image reliability are lacking in contemporary atomic force microscopy literature. In this article, we present a real-time technique that provides an image of fidelity for a high bandwidth dynamic mode imaging scheme. The fidelity images define channels that allow the user to have additional authority over the choice of decision threshold that facilitates where the emphasis is desired, on discovering most true features on the sample with the possible detection of high number of false features, or emphasizing minimizing instances of false detections. Simulation and experimental results demonstrate the effectiveness of fidelity imaging.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/ghosal2015fidelity.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "AIP Publishing",
		"year": "2015",
		"pages": "013113",
		"number": "1",
		"volume": "106",
		"journal": "Applied Physics Letters",
		"author": ["Ghosal, Sayan", "Salapaka, Murti"],
		"pubId": "ghosal2015fidelity",
		"title": "Fidelity imaging for atomic force microscopy"
	}, {
		"abstract": "Engineered transport of material at the nano/micro scale is essential for the manufacturing platforms of the future. Unlike conventional transport systems, at the nano/micro scale, transport has to be achieved in the presence of fundamental sources of uncertainty such as thermal noise. Remarkably, it is possible to extract useful work by rectifying noise using an asymmetric potential; a principle used by Brownian ratchets. In this article a systematic methodology for designing open-loop Brownian ratchet mechanisms that optimize velocity and efficiency is developed. In the case where the particle position is available as a measured variable, closed loop methodologies are studied. Here, it is shown that methods that strive to optimize velocity of transport may compromise efficiency. A dynamic programming based approach is presented which yields up to three times improvement in efficiency over optimized open loop designs and 35% better efficiency over reported closed loop strategies that focus on optimizing velocities.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/roychowdhury2015control.pdf",
		"type": "journal",
		"catid": "theory",
		"publisher": "Elsevier",
		"year": "2015",
		"pages": "76-86",
		"number": "",
		"volume": "27",
		"journal": "Journal of Process Control",
		"author": ["Roychowdhury, Subhrajit", "Saraswat, Govind", "Salapaka, Srinivasa", "Salapaka, Murti"],
		"pubId": "roychowdhury2015control",
		"title": "On control of transport in Brownian ratchet mechanisms"
	}, {
		"abstract": "Many complex systems can be described by agents that can be modeled as a network of dynamically interacting cyclo-stationary processes. Such systems arise in areas like power systems and climate sciences. For many of these systems a key objective is to understand mutual influences between various subsystems without altering the natural behavior of the system. Such an objective translates to unveiling the interconnection of the topology of the network using only passive means. Most existing related works have emphasized correlation based methods where interdependencies over different time-instants can be missed. Recent work where dynamic influences are incorporated assuming stationary statistics cannot accommodate applications that arise in many areas such as power and climate sciences. In this article an algorithm based on Wiener filtering is devised for the reconstruction of interconnectivity of dynamically related cyclo-stationary processes. It is shown that all existing interdependencies are detected and spurious detection remains local. Application to a microgrid power network is shown to yield useful insights.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/talukdar2015reconstruction.pdf",
		"type": "conference",
		"catid": "power systems",
		"publisher": "",
		"year": "2015",
		"pages": "783-788",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Talukdar, Saurav", "Prakash, Mangal", "Materassi, Donatello", "Salapaka, Murti V"],
		"pubId": "talukdar2015reconstruction",
		"title": "Reconstruction of networks of cyclostationary processes"
	}, {
		"abstract": "Lur'e systems are the feedback interconnection of a linear time-invariant system with a memoryless static operator. In this paper, we derive an algorithmic method to incorporate the information given by additional Lyapunov functions in order to enlarge the estimate of the domain of attraction of a Lur'e system. The methodology, limited for simplicity to quadratic Lyapunov functions, relies on the solution of a sequence of convex optimization programs. The ideas formulated in this article have general validity and can be extended to other scenarios (for example considering Lyapunov functions in the form of sum of squares.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/materassi2015algorithmic.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2015",
		"pages": "571-576",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Materassi, Donatello", "Salapaka, Murti V"],
		"pubId": "materassi2015algorithmic",
		"title": "An algorithmic approach for lessening conservativeness of criteria determining absolute stability"
	}, {
		"abstract": "In microgrids that are predominantly resistive, real and reactive power can be controlled by implementation of voltage and frequency droop laws respectively. However, the variable frequency displayed by such a system complicates analysis such that design approaches rely on approximations and linearized models. In this work, we present a modified form of droop control where only the voltage versus real power relationship is upheld and the frequency is held constant. Since the frequency is not explicitly controlled and the reactive power is not measured, the controller can be simplified. In such a setting, the only assumption we make is that all inverters have access to a common time-reference. Because fixed frequency operation is enforced by design, a variety of analytical tools can be leveraged to formulate a comprehensive analytical framework which facilitates a precise design methodology. In particular, closed-form expressions on the output current phase differences are obtained which yield practical selection guidelines on the voltage-power droop gains such that reactive flows between inverters are kept small. As a corollary, it is demonstrated that there are no reactive power flows in the presence of purely resistive loads. For the particular case of a single inverter, an almost exact solution describing the nonlinear dynamics of the inverter output voltage, current, and power are derived. Accompanying simulation results validate the analytical results and demonstrate the feasibility of the proposed control approach.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/salapaka2014viability.pdf",
		"type": "conference",
		"catid": "power systems",
		"publisher": "",
		"year": "2014",
		"pages": "3246-3251",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Salapaka, Srinivasa", "Johnson, Brian", "Lundstrom, Blake", "Kim, Sangsun", "Collyer, Scott", "Salapaka, Murti"],
		"pubId": "salapaka2014viability",
		"title": "Viability and analysis of implementing only voltage-power droop for parallel inverter systems"
	}, {
		"abstract": "Microgrids formed by a network of power sources and power consumers yield significant advantages over the conventional power grid including proximity of power consumption to power generation, distributed generation, resiliency against wide area blackouts and ease of incorporation of renewable energy sources. On the other hand, unlike the conventional grid, microgrids are compliant where a single load or a single generation unit can often form a significant fraction of the total generation capacity. Here large excursions from the nominal operating conditions are possible motivating the need for safety mechanisms which isolate power electronic equipment from damage. Breakers serve the purpose of protecting equipment from surge conditions by shutting off, for example, generation units. However in microgrids, a loss of a single generation unit can have catastrophic impact on the viability of the entire system. Here settings on breakers cannot be chosen too conservatively to protect the equipment at the expense of system viability or too liberally which will result in equipment damage. The ensuing problem of striking a suitable compromise tends to be combinatoric in nature due to numerous states of breakers which is further exacerbated by an uncertain load profile and nonlinear nature of system dynamics. In this article we provide a methodology to determine current thresholds and guard times, the time interval when current is allowed to exceed threshold value, for each inverter for fail-safe operation of microgrid. We employ a machine learning approach to address the problem where we first demonstrate that conventional support vector machine (SVM) methodology does not yield a satisfactory solution. We then develop a one-sided SVM method and generalize it to yield nonlinear support boundaries which captures the need for fail-safe operation against system blackouts while protecting equipment. A simulation engine is developed to model a real microgrid which is used to generate data for assessing and guiding our approach.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/wytock2014preventing.pdf",
		"type": "conference",
		"catid": "power systems",
		"publisher": "",
		"year": "2014",
		"pages": "3252-3258",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Wytock, Matt", "Salapaka, Srinivasa", "Salapaka, Murti"],
		"pubId": "wytock2014preventing",
		"title": "Preventing cascading failures in microgrids with one-sided support vector machines"
	}, {
		"abstract": "Tailoring the properties of a material at the nanoscale holds the promise of achieving hitherto unparalleled specificity of the desired behavior of the material. Key to realizing this potential of tailoring materials at the nanoscale are methods for rapidly estimating physical properties of the material at the nanoscale. In this paper, we report a method for simultaneously determining the topography, stiffness and dissipative properties of materials at the nanoscale in a probe based dynamic mode operation. The method is particularly suited for investigating soft-matter such as polymers and bio-matter. We use perturbation analysis tools for mapping dissipative and stiffness properties of material into parameters of an equivalent linear time-invariant model. Parameters of the equivalent model are adaptively estimated, where, for robust estimation, a multi-frequency excitation of the probe is introduced. We demonstrate that the reported method of simultaneously determining multiple material properties can be implemented in real-time on existing probe based instruments. We further demonstrate the effectiveness of the method by investigating properties of a polymer blend in real-time.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/saraswat2013real.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "IOP Publishing",
		"year": "2013",
		"pages": "265706",
		"number": "26",
		"volume": "24",
		"journal": "Nanotechnology",
		"author": ["Saraswat, G", "Agarwal, P", "Haugstad, G", "Salapaka, MV"],
		"pubId": "saraswat2013real",
		"title": "Real-time probe based quantitative determination of material properties at the nanoscale"
	}, {
		"abstract": "We consider error probability analysis for a class of ISI channels with data-dependent Gauss�Markov noise and propose an efficiently computable BER upper bound that is tight in the high SNR regime.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/kumar2013error.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "Institute of Electrical and Electronics Engineers, Inc., 345 E. 47 th St. NY NY 10017-2394 United States",
		"year": "2013",
		"pages": "3647-3652",
		"number": "14",
		"volume": "61",
		"journal": "IEEE Transactions on Signal Processing",
		"author": ["Kumar, Naveen", "Ramamoorthy, Aditya", "Salapaka, Murti V"],
		"pubId": "kumar2013error",
		"title": "Error analysis for ML sequence detection in ISI channels with Gauss Markov Noise"
	}, {
		"abstract": "Intracellular transport is crucial for many cellular processes where a large fraction of the cargo is transferred by motor-proteins over a network of microtubules. Malfunctions in the transport mechanism underlie a number of medical maladies. Existing methods for studying how motor-proteins coordinate the transfer of a shared cargo over a microtubule are either analytical or are based on Monte-Carlo simulations. Approaches that yield analytical results, while providing unique insights into transport mechanism, make simplifying assumptions, where a detailed characterization of important transport modalities is difficult to reach. On the other hand, Monte-Carlo based simulations can incorporate detailed characteristics of the transport mechanism; however, the quality of the results depend on the number and quality of simulation runs used in arriving at results. Here, for example, it is difficult to simulate and study rare-events that can trigger abnormalities in transport.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/materassi2013exact.pdf",
		"type": "journal",
		"catid": "theory",
		"publisher": "BioMed Central Ltd",
		"year": "2013",
		"pages": "14",
		"number": "1",
		"volume": "6",
		"journal": "BMC biophysics",
		"author": ["Materassi, Donatello", "Roychowdhury, Subhrajit", "Hays, Thomas", "Salapaka, Murti"],
		"pubId": "materassi2013exact",
		"title": "An exact approach for studying cargo transport by an ensemble of molecular motors"
	}, {
		"abstract": "Use of optical tweezers for load force regulation on processive motors has yielded significant insights into intracellular transport mechanisms. The methodology developed in this letter circumvents the limitations of existing active force clamps with the use of experimentally determined models for various components of the optical tweezing system, thus making it possible to probe motor proteins at higher speeds. This paradigm also allows for real-time step estimation for step sizes as small as 8?nm with dwell time of 5?ms or higher without sacrificing force regulation.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/roychowdhury2013high.pdf",
		"type": "journal",
		"catid": "optical tweezers",
		"publisher": "AIP Publishing",
		"year": "2013",
		"pages": "153703",
		"number": "15",
		"volume": "103",
		"journal": "Applied Physics Letters",
		"author": ["Roychowdhury, Subhrajit", "Aggarwal, Tanuj", "Salapaka, Srinivasa", "Salapaka, Murti V"],
		"pubId": "roychowdhury2013high",
		"title": "High bandwidth optical force clamp for investigation of molecular motor motion"
	}, {
		"abstract": "Flashing ratchet is a mechanism which employs noise under isothermal and non equilibrium conditions. Its primary is to transport of small particles, possibly against a load force, under the influence of thermal noise and potential energy landscapes that can be realized locally, near the particles position. In this article we present a dynamic programming based approach to analyze and synthesize optimal strategies in the presence of a non-zero load force and finite sampling intervals. We show that it is possible to obtain an order increase in velocity and stalling force, over open-loop strategies. Besides engineered systems, study of such strategy is also important to gain insights on the intra-cellular transport of motor proteins (such as Kinesin and Dynein) on a microtubular track, and on the role of feedback control on their transport.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/roychowdhury2013dynamic.pdf",
		"type": "conference",
		"catid": "AFM",
		"publisher": "",
		"year": "2013",
		"pages": "1105-1110",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Roychowdhury, Subhrajit", "Saraswat, Govind", "Salapaka, Murti V"],
		"pubId": "roychowdhury2013dynamic",
		"title": "Dynamic programming based approach for optimal transport by flashing ratchet against a load force"
	}, {
		"abstract": "Since its inception, optical traps have become an important tool for single molecule investigation because of its precise ability to manipulate microparticles and probe systems with a force resolution of the order of fN. Its use as a constant force clamp is of particular importance in the study of molecular motors and DNA. The highly nonlinear nature (specially the presence of hysteresis) of the force-extension relationships in such biomolecules is traditionally modelled as a linear Hookean spring for small force perturbations. For these linear models to hold, high disturbance rejection bandwidths are required so that the perturbations from the regulated values remain small. The absence of systematic design and performance quantification in the current literature is addressed by designing an optimized PI and a H? controller, that significantly improve the force regulation and its bandwidth. A major application of constant force clamps is in step detection of biomolecules, where due to the presence of thermal noise, one has to extract the stepping data via postprocessing. In this paper, a real time step-detection scheme, currently lacking in literature, is achieved via a mixed objective H2/H? synthesis. In the design, the H? norm for force regulation and stepping estimation error is minimized while keeping the H2 norm of the thermal noise on the stepping estimate is kept bounded.Since its inception, optical traps have become an important tool for single molecule investigation because of its precise ability to manipulate microparticles and probe systems with a force resolution of the order of fN. Its use as a constant force clamp is of particular importance in the study of molecular motors and DNA. The highly nonlinear nature (specially the presence of hysteresis) of the force-extension relationships in such biomolecules is traditionally modelled as a linear Hookean spring for small force perturbations. For these linear models to hold, high disturbance rejection bandwidths are required so that the perturbations from the regulated values remain small. The absence of systematic design and performance quantification in the current literature is addressed by designing an optimized PI and a H? controller, that significantly improve the force regulation and its bandwidth. A major application of constant force clamps is in step detection of biomolecules, where due to the presence of thermal noise, one has to extract the stepping data via postprocessing. In this paper, a real time step-detection scheme, currently lacking in literature, is achieved via a mixed objective H2/H? synthesis. In the design, the H? norm for force regulation and stepping estimation error is minimized while keeping the H2 norm of the thermal noise on the stepping estimate is kept bounded.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/roychowdhury2013design.pdf",
		"type": "conference",
		"catid": "AFM",
		"publisher": "",
		"year": "2013",
		"pages": "1525-1530",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Roychowdhury, Subhrajit", "Bhaban, Shreyas", "Salapaka, Srinivasa", "Salapaka, Murti"],
		"pubId": "roychowdhury2013design",
		"title": "Design of a constant force clamp and estimation of molecular motor motion using modern control approach"
	}, {
		"abstract": "The atomic force microscope (AFM) is one of the major advances in recent science that has enabled imaging of samples at the nanometer scale. Over the years, different techniques have been developed to improve the speed, resolution and accuracy of imaging using AFM. As AFMs can scan and deform material with extremely high resolution, it has also been used as a data read-write system where the high or low topography of the sample surface are interpreted as a one or a zero bit. Data storage using this method can produce extremely high data storage density. In this paper a new method called the innovations mismatch method (IM) is developed that can be used for both imaging and data storage applications. The IM scheme utilizes the dynamic mode of operation and therefore is applicable to soft matter interrogation. In this work, IM method is shown to outperform previously developed techniques.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/ghosal2013topography.pdf",
		"type": "conference",
		"catid": "AFM",
		"publisher": "",
		"year": "2013",
		"pages": "5500-5505",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Ghosal, Sayan", "Saraswat, Govind", "Ramamoorthy, Aditya", "Salapaka, Murti"],
		"pubId": "ghosal2013topography",
		"title": "Topography detection using innovations mismatch method for high speed and high density dynamic mode AFM"
	}, {
		"abstract": "In many applications, it is of interest to derive information about the topology and the internal connections of multiple dynamical systems interacting together. Examples can be found in fields as diverse as Economics, Neuroscience and Biochemistry. The paper deals with the problem of deriving a descriptive model of a network with no a-priori knowledge on its topology. It is assumed that the network nodes are passively observed and data are collected in the form of time series. The underlying structure is then determined by the non-zero entries of a �sparse Wiener filter�. We cast the problem as the optimization of a quadratic cost function, where a set of parameters are used to operate a trade-off between accuracy and complexity in the final model.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/materassi2013model.pdf",
		"type": "journal",
		"catid": "theory",
		"publisher": "Elsevier",
		"year": "2013",
		"pages": "664-672",
		"number": "8",
		"volume": "62",
		"journal": "Systems \\& Control Letters",
		"author": ["Materassi, Donatello", "Innocenti, Giacomo", "Giarr�, Laura", "Salapaka, M"],
		"pubId": "materassi2013model",
		"title": "Model identification of a network as compressing sensing"
	}, {
		"abstract": "Atomic force microscopy (AFM) was invented in 1986. By using a compliant flexure probe, such as a microcantilever beam with a sharp tip at one end, the interaction forces between atoms on the probe-tip and atoms on the material surface can be measured (see Figure 1). Since its invention, the simple strategy of using a beam with a sharp tip is now being employed to measure many diverse properties of matter at the nanometer scale including electrical, magnetic, chemical, and mechanical properties. Many different operational modes have evolved that have demonstrated the versatility of the basic underlying principle. AFM has led to many seminal insights in science such as obtained in the recent imaging of pentacene molecules with subatomic resolution.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/salapaka2013afm.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "IEEE",
		"year": "2013",
		"pages": "106-118",
		"number": "6",
		"volume": "33",
		"journal": "IEEE Control Systems",
		"author": ["Salapaka, Srinivasa M", "Ramamoorthy, Aditya", "Salapaka, Murti V"],
		"pubId": "salapaka2013afm",
		"title": "AFM Imaging? Reliable or Not?: Validation and Verification of Images in Atomic Force Microscopy"
	}, {
		"abstract": "Dynamic mode operation of Atomic Force Microscopes relies on demodulation schemes to get information from different flexure modes of the cantilever while imaging a sample. In the article, we demonstrate that the conventional approach of discerning higher mode participation via amplitude and phase demodulation is not suitable for high bandwidth applications. Furthermore, we provide a method where the higher mode participation is reconstructed with high fidelity, and present a scheme for high bandwidth detection of higher modes when their participation becomes significant. These methods are shown to outperform the traditional amplitude-phase demodulation schemes in terms of speed, resolution, and fidelity. The framework developed is tested on simulations and the method's utility for first two modes is demonstrated experimentally.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/saraswat2013contribution.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "AIP Publishing",
		"year": "2013",
		"pages": "173108",
		"number": "17",
		"volume": "102",
		"journal": "Applied Physics Letters",
		"author": ["Saraswat, Govind", "Salapaka, Murti V"],
		"pubId": "saraswat2013contribution",
		"title": "On contribution and detection of higher eigenmodes during dynamic atomic force microscopy"
	}, {
		"abstract": "Determining the relation structure of various interconnected entities from multiple time series data is of significant interest to many areas. Knowledge of such a structure can aid in identifying cause and effect relationships, clustering of similar entities, detecting representative elements for an aggregate and determining reduced order models. Current methods tend to treat observations in a static manner by modeling the measured time series as repeated realizations of as many random variables that are independent over time. This amounts to assume static relationships among the measurements, making these techniques ill-suited for detecting propagative and dynamic phenomena that can be fundamental for the understanding of the system. In this paper we extend techniques for the identification of networks of random variables connected through static relations to the case of random processes with dynamic relations. This is achieved by showing that the Wiener filter defines a relationship among jointly stationary stochastic processes that has the properties of a semi-graphoid.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/materassi2013reconstruction.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2013",
		"pages": "4687-4692",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Materassi, Donatello", "Salapaka, Murti V"],
		"pubId": "materassi2013reconstruction",
		"title": "Reconstruction of directed acyclic networks of dynamical systems"
	}, {
		"abstract": "This article investigates the multimode model of the cantilever beam during probe based imaging. It develops a framework to quantify the effects of different material properties like dissipativity and stiffness in a near tapping mode operation of Atomic Force Microscope (AFM), which is the primary mode of imaging soft matter, when excitation consists of more than one sinusoids. Averaging theory forms an important basis and provides the theoretical foundations. Effect of dissipative and stiffness properties of the sample on the forces experienced by probe is modeled as changes in parameters of an equivalent linear time invariant model, of the cantilever-sample system. It is shown that this model can be extended to the case when multiple modes of the cantilever participate in the nonlinear interaction with the sample forces.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/saraswat2013multimode.pdf",
		"type": "conference",
		"catid": "AFM",
		"publisher": "",
		"year": "2013",
		"pages": "5506-5511",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Saraswat, Govind", "Agarwal, Pranav", "Salapaka, Murti V"],
		"pubId": "saraswat2013multimode",
		"title": "Multimode and multitone analysis of the dynamic mode operation of the Atomic Force Microscope"
	}, {
		"abstract": "The paper deals with the problem of unveiling the link structure of a network of linear dynamical systems. A technique is provided guaranteeing an exact detection of the links of a network of dynamical systems with no undirected cycles (Linear Dynamic Polytrees). In particular, the presence of unobserved (latent) nodes is taken into account. Knowledgeon the specific number of hidden processes is not required. It is proven that the topology can be consistently reconstructed, as long the degree of each latent node is at least three with outdegree of at least two. The result extends previous work that was limited to a more restricted class of dynamical systems (Rooted Trees).",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/materassi2012unobservedNodes.pdf",
		"type": "conference",
		"catid": "theory,networks",
		"publisher": "",
		"year": "2012",
		"pages": "4629-4634",
		"number": "",
		"volume": "",
		"journal": "Decision and Control (CDC), 2012 IEEE 51st Annual Conference on",
		"author": ["Materassi, Donatello", "Salapaka, Murti V"],
		"pubId": "materassi2012unobservednodes",
		"title": "Network reconstruction of dynamical polytrees with unobserved nodes"
	}, {
		"abstract": "This paper develops a model for Brownian ratchets to analyze the cases where the transport characteristics are affected by feedback mechanisms. One main application of this approach is to gain insights on the intracellular transport of motor proteins (such as Kinesin and Dynein) on a microtubular track, and on the role of feedback control on their transport. The model comprises of a stochastic system where the system switches between two stochastic differential systems, where the switching criteria is a state-dependent stochastic variable. Simulations demonstrate that the feedback mechanism helps achieve an increased average velocity of transport and corroborates the hypothesis that a motor protein can achieve higher speeds of transport by restricting or enabling attachment/detachment of ATP/ADP like molecules depending on conformational changes in the motor-protein.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/salapaka2012brownian.pdf",
		"type": "conference",
		"catid": "optical tweezers,theory,brownian ratchets,motor-proteins",
		"publisher": "",
		"year": "2012",
		"pages": "374-379",
		"number": "",
		"volume": "",
		"journal": "Decision and Control (CDC), 2012 IEEE 51st Annual Conference on",
		"author": ["Salapaka, Srinivasa", "Rowchowdhury, Subhrajit", "Salapaka, Murti"],
		"pubId": "salapaka2012brownian",
		"title": "Modeling and role of feedback controlled stochastic ratchets in cellular transport"
	}, {
		"abstract": "Determining interrelatedness structure of various entities from multiple time series data is of significant interest to many areas. Knowledge of such a structure can aid in identifying cause and effect relationships, clustering of similar entities, identification of representative elements and model reduction. The majority of existing results are based on correlation based indices which effectively assume a static relationship between the time series data and are not suitable for detecting interrelatedness when the time series are dynamically related or when the time series involve loops. In this paper, a methodology for identifying the interrelatedness structure of dynamically related time series data is presented that also allows for the presence of loops in the connectivity structure. A linear dynamic graph model is presented where it is assumed that each time series data is the sum of an independent stochastic noise source and a dynamically weighted sum of other time series data. A link is assumed to be present between two time series if the weight of a time series, which is a linear time-invariant filter, is nonzero in the formation of the other. Reconstruction of the link connectivity structure under various scenarios is considered. It is shown that when the linear dynamic graph is allowed to admit non-causal weights, then the links structure can be recovered with the possibility of identifying spurious connections. However, it is shown that the spurious links remain local, where, a spurious link is restricted to be within one hop of a true link. Furthermore, strategies for exact reconstruction of the link structure when the weights are restricted to be causal are developed. The main tools for determining the network topology are based on variations of Wiener filtering. A significant insight provided by the article is that, in the class of network models considered in the paper, the Wiener filter estimating a stochastic process based on other processes remain- local in the sense that the Wiener filter utilizes only measurements local to the node being estimated.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/reconstructTopologyMatSal12.pdf",
		"type": "journal",
		"catid": "control theory",
		"publisher": "",
		"year": "2012",
		"pages": "1765-1777",
		"number": "7",
		"volume": "57",
		"journal": "IEEE Transactions on Automatic Control",
		"author": ["Materassi, Donatello", "Salapaka, Murti V."],
		"pubId": "reconstructtopologymatsal12",
		"title": "On the problem of reconstructing an unknown topology"
	}, {
		"abstract": "This paper studies open-loop operation of flashing ratchets, which refer to mechanisms that enable motion of particles under diffusion and possibly drag forces along a preferred direction through alternating turning on and off of specifically designed ratchet potentials. Flashing ratchets are used to model certain transport mechanisms of molecular motors and are of special interest to biologists and biophysicists. Mathematically they are are modeled by stochastic hybrid systems. For an open-loop design of on-times and off-times, we derive, under certain practical assumptions, an exact probability density function that reflects the spatial distribution of particles in space after the ratchet has flashed a given number of times, and find an optimal off-time that maximizes the transport velocity for a specific ratchet potential. Validation of the underlying assumptions is also presented. Simulation results show that these open-loop designs achieve as good or better average velocities for particles over certain well known existing feedback strategies in literature.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/rowchowdhury2012maximizing.pdf",
		"type": "conference",
		"catid": "optical tweezers,theory,brownian ratchets,motor-proteins",
		"publisher": "",
		"year": "2012",
		"pages": "3210-3215",
		"number": "",
		"volume": "",
		"journal": "American Control Conference (ACC), 2012",
		"author": ["Rowchowdhury, Subhrajit", "Salapaka, Srinivasa", "Salapaka, Murti"],
		"pubId": "rowchowdhury2012maximizing",
		"title": "Maximizing transport in open loop for flashing ratchets"
	}, {
		"abstract": "Over the past few decades, single molecule investigations employing optical tweezers, AFM and TIRF microscopy have revealed that molecular behaviors are typically characterized by discrete steps or events that follow changes in protein conformation. These events, that manifest as steps or jumps, are short-lived transitions between otherwise more stable molecular states. A major limiting factor in determining the size and timing of the steps is the noise introduced by the measurement system. To address this impediment to the analysis of single molecule behaviors, step detection algorithms incorporate large records of data and provide objective analysis. However, existing algorithms are mostly based on heuristics that are not reliable and lack objectivity. Most of these step detection methods require the user to supply parameters that inform the search for steps. They work well, only when the signal to noise ratio (SNR) is high and stepping speed is low. In this report, we have developed a novel step detection method that performs an objective analysis on the data without input parameters, and based only on the noise statistics. The noise levels and characteristics can be estimated from the data providing reliable results for much smaller SNR and higher stepping speeds. An iterative learning process drives the optimization of step-size distributions for data that has unimodal step-size distribution, and produces extremely low false positive outcomes and high accuracy in finding true steps. Our novel methodology, also uniquely incorporates compensation for the smoothing affects of probe dynamics. A mechanical measurement probe typically takes a finite time to respond to step changes, and when steps occur faster than the probe response time, the sharp step transitions are smoothed out and can obscure the step events. To address probe dynamics we accept a model for the dynamic behavior of the probe and invert it to reveal the steps. No other existing method addresses the impact of probe dynamics on step detection. Importantly, we have also developed a comprehensive set of tools to evaluate various existing step detection techniques. We quantify the performance and limitations of various step detection methods using novel evaluation scales. We show that under these scales, our method provides much better overall performance. The method is validated on different simulated test cases, as well as experimental data.",
		"highlights": "journalArticles/aggarwal2012detection.pdf",
		"pdflink": "journalArticles/aggarwal2012detection.pdf",
		"type": "journal",
		"catid": "theory,afm,optical tweezers",
		"publisher": "Springer New York",
		"year": "2012",
		"pages": "14-31",
		"number": "1",
		"volume": "5",
		"journal": "Cellular and Molecular Bioengineering",
		"author": ["Aggarwal, Tanuj", "Materassi, Donatello", "Davison, Robert", "Hays, Thomas", "Salapaka, Murti"],
		"pubId": "aggarwal2012detection",
		"title": "Detection of Steps in Single Molecule Data"
	}, {
		"abstract": "Feedback enhanced optical tweezers with position regulation capability enable detection and estimation of forces in the pico-Newton regime. In this article we delineate the fundamental limitations and challenges of existing approaches for regulating position and force estimation in an optical tweezer. A modern control systems approach is shown to improve the bandwidth of force estimation by three to four times which is corroborated experimentally.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/aggarwal2011robust.pdf",
		"type": "journal",
		"catid": "optical tweezers",
		"publisher": "AIP",
		"year": "2011",
		"pages": "115108-115108",
		"number": "11",
		"volume": "82",
		"journal": "Review of Scientific Instruments",
		"author": ["Aggarwal, T.", "Sehgal, H.", "Salapaka, M."],
		"pubId": "aggarwal2011robust",
		"title": "Robust control approach to force estimation in a constant position optical tweezers"
	}, {
		"abstract": "The article main focus is on the identification of a graphical model from time series data associated with different interconnected entities. The time series are modeled as realizations of stochastic processes (representing nodes of a graph) linked together via transfer functions (representing the edges of the graph). Both the cases of non-causal and causal links are considered. By using only the measurements of the node outputs and without assuming any prior knowledge of the network topology, a method is provided to estimate the graph connectivity. In particular, it is proven that the method determines links to be present only between a node and its #x201C;kins #x201D;, where kins of a node consist of parents, children and co-parents (other parents of all of its children) in the graph. With the additional hypothesis of strictly casual links, a similar method is provided that allows one to exactly reconstruct the original graph. Main tools for determining the network topology are based on Wiener, Wiener-Hopf and Granger filtering. Analogies with the problem of Compressing Sensing are drawn and two greedy algorithms to address the problem of reducing the complexity of the network structure are also suggested.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/StructureAndEstimators.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2011",
		"pages": "162-167",
		"number": "",
		"volume": "",
		"journal": "Decision and Control and European Control Conference (CDC-ECC), 2011 50th IEEE Conference on",
		"author": ["Materassi, D.", "Salapaka, M.V.", "Giarre, L."],
		"pubId": "structureandestimators",
		"title": "Relations between structure and estimators in networks of dynamical systems"
	}, {
		"abstract": "Lur'e systems represent feedback interconnections of a Linear Time-Invariant system with a nonlinear operator. The Zames-Falb criterion is a powerful tool to determine the stability of a Lur'e system when the nonlinear operator is defined by a monotonic, odd and single-valued function. The article provides a generalization of the Zames-Falb criterion for the analysis of stability of a Lur'e system for nonlinear static operators that are approximately monotonic and odd. This result extends the standard Zames-Falb criterion with an additional notion of robustness.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/zamesFalbRelaxed.pdf",
		"type": "journal",
		"catid": "control theory",
		"publisher": "IEEE",
		"year": "2011",
		"pages": "1432-1436",
		"number": "99",
		"volume": "",
		"journal": "IEEE Transactions on Automatic Control",
		"author": ["Materassi, D.", "Salapaka, M."],
		"pubId": "materassi2011zamesfalbgeneralized",
		"title": "A Generalized Zames-Falb Multiplier"
	}, {
		"abstract": "In many diverse areas, determining the connectivity of various entities in a network is of significant interest. This article's main focus is on a network (graph) of nodes (vertices) that are linked via filters that represent the edges of a graph. Both cases of the links being non-causal and causal are considered. Output of each node of the graph represents a scalar stochastic process driven by an independent noise source and by a sum of filtered outputs of nodes linked to the node of interest. It is shown that the method provided will identify all true links in the network with some spurious links added. The spurious links remain local in the sense that they are added within a hop of a true link. In particular, it is proven that the method determines a link to be present only between the kins of a node where kins of a node consist of parents, children and co-parents (other parents of all of its children) in the graph. Main tools for determining the network topology is based on Wiener filtering. Another significant insight provided by the article is that the Wiener filter estimating a stochastic process, represented by a node, based on other processes in a network configuration remains local in the sense that the Wiener filter utilizes only measurements local to the node being estimated.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/NetworkReconstruction.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2011",
		"pages": "4928-4933",
		"number": "",
		"volume": "",
		"journal": "American Control Conference (ACC), 2011",
		"author": ["Materassi, D.", "Salapaka, M.V."],
		"pubId": "networkreconstruction",
		"title": "Causal and non-causal filtering for network reconstruction"
	}, {
		"abstract": "Lur'e systems represent feedback interconnections of a Linear Time-Invariant system with a nonlinear operator. The Zames-Falb criterion is a powerful tool to determine the stability of a Lur'e system when the nonlinear operator is defined by a monotonic, odd and single-valued function. The article provides a generalization of the Zames-Falb criterion for the analysis of stability of a Lur'e system for nonlinear static operators that are \"approximately\" monotonic and odd. This result extends the standard Zames-Falb criterion with an additional notion of \"robustness\".",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/ZamesFalbMultiplier.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2011",
		"pages": "1990-1993",
		"number": "",
		"volume": "",
		"journal": "American Control Conference (ACC), 2011",
		"author": ["Materassi, D.", "Salapaka, M.V."],
		"pubId": "zamesfalbmultiplier",
		"title": "A generalized Zames-Falb multiplier"
	}, {
		"abstract": "Recent technology has led to systems with architectures that distribute the controller effort over subcontrollers to respect information flow and/or resource constraints. The associated communication uncertainty between sub-controllers partly governs the performance of the controller. The related controller synthesis methodology has to address internal stability concerns and has to incorporate the effect of communication uncertainty into the performance metric. In this article, it is demonstrated that different canonical distributed architectures derived from a centralized design can result in appreciably different performance. Architectures of information flow that result in convex optimization problems are developed and syn- thesis methods to incorporate robustness with respect to model uncertainty of communication channels are obtained. The efficacy of the approach is demonstrated on application problems.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/archsDistrCntrSubCntrlUncertain.pdf",
		"type": "journal",
		"catid": "control theory,distributed control",
		"publisher": "IEEE",
		"year": "2010",
		"pages": "1765-1780",
		"number": "8",
		"volume": "55",
		"journal": "IEEE Transactions on Automatic Control",
		"author": ["Yadav, V.", "Salapaka, M.V.", "Voulgaris, P.G."],
		"pubId": "yadav2010architectures",
		"title": "Architectures for Distributed Controller With Sub-Controller Communication Uncertainty"
	}, {
		"abstract": "There is an increasing need for high density data storage devices driven by the increased demand of consumer electronics. In this work, we consider a data storage system that operates by encoding information as topographic profiles on a polymer medium. A cantilever probe with a sharp tip (few nm radius) is used to create and sense the presence of topographic profiles, resulting in a density of few Tb per inch square. The prevalent mode of using the cantilever probe is the static mode that is harsh on the probe and the media. In this article, the high quality factor dynamic mode operation, that is less harsh on the media and the probe, is analyzed. The read operation is modeled as a communication channel which incorporates system memory due to inter-symbol interference and the cantilever state. We demonstrate an appropriate level of abstraction of this complex nanoscale system that obviates the need for an involved physical model. Next, a solution to the maximum likelihood sequence detection problem based on the Viterbi algorithm is devised. Experimental and simulation results demonstrate that the performance of this detector is several orders of magnitude better than the performance of other existing schemes.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/maxLikelihoodSeqDetHiDensStor.pdf",
		"type": "journal",
		"catid": "afm, data storage",
		"publisher": "IEEE",
		"year": "2010",
		"pages": "1686-1694",
		"number": "6",
		"volume": "58",
		"journal": "IEEE Transactions on Communications",
		"author": ["Kumar, N.", "Agarwal, P.", "Ramamoorthy, A.", "Salapaka, M."],
		"pubId": "kumar2010maximum",
		"title": "Maximum-likelihood sequence detector for dynamic mode high density probe storage"
	}, {
		"abstract": "Photodiode based detection of laser trapped beads using forward scattered light is a frequently employed technique for position measurement. There is a nonlinear relationship between photodiode outputs and bead position but for small displacements linear approximation holds well. Traditionally, the nonlinearity is compensated by normalizing the photodiode's position signal with the intensity signal and then using a polynomial fit in the range where voltage to position mapping is one to one. In this article, this range is extended by using the intensity signal as an independent input along with the two position signals. A map from the input signals to the actual position values is obtained. This mapping is one-to-one for a larger range that results in an increased detection range. An artificial neural network that facilitates implementation is employed for this purpose. This scheme is implemented on a Field Programmable Gate Array based data acquisition and control hardware with closed loop bandwidth of 50 kHz. Detection of the order of 350 nm from the center of detection laser is demonstrated for a 500 nm diameter bead compared to 180 nm achieved by a polynomial fit.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/realTimeCorrOfOtDetection.pdf",
		"type": "journal",
		"catid": "optical tweezers",
		"publisher": "AIP",
		"year": "2010",
		"pages": "123105-123105",
		"number": "12",
		"volume": "81",
		"journal": "Review of Scientific Instruments",
		"author": ["Aggarwal, T.", "Salapaka, M."],
		"pubId": "tanujrsiphotodioderange2010",
		"title": "Real-time nonlinear correction of back-focal-plane detection in optical tweezers"
	}, {
		"abstract": "The atomic force microscope (AFM) is widely used for studying the surface morphology and growth of live cells. There are relatively fewer reports on the AFM imaging of yeast cells [1] (Kasas and Ikai, 1995), [2] (Gad and Ikai, 1995). Yeasts have thick and mechanically strong cell walls and are therefore difficult to attach to a solid substrate. In this report, a new immobilization technique for the height mode imaging of living yeast cells in solid media using AFM is presented. The proposed technique allows the cell surface to be almost completely exposed to the environment and studied using AFM. Apart from the new immobilization protocol, for the first time, height mode imaging of live yeast cell surface in intermittent contact mode is presented in this report. Stable and reproducible imaging over a 10-h time span is observed. A significant improvement in operational stability will facilitate the investigation of growth patterns and surface patterns of yeast cells.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/immobilizeYeastCells.pdf",
		"type": "journal",
		"catid": "afm,yeast,bio",
		"publisher": "",
		"year": "2010",
		"pages": "254-258",
		"number": "110,3",
		"volume": "19",
		"journal": "Ultramicroscopy",
		"author": ["T, De", "AM, Chettoor", "P, Agarwal", "Salapaka MV, Nettikadan S."],
		"pubId": "de2010immobilization",
		"title": "Immobilization method of yeast cells for intermittent contact mode imaging using the atomic force microscope"
	}, {
		"abstract": "Microcantilevers with integrated thermal sensor for topography measurement, which can be electrostatically actuated, are well suited for a highly parallel dynamic-mode operation where multiple cantilevers scan the media. Interpretation of data in dynamic-mode operation utilizing such cantilevers is complex because of diverse forces acting on the cantilever that include electrostatic, interatomic, structural, thermal, and, possibly, magnetic forces. In addition, the thermal sensor introduces new dynamics making interpretation of measured data challenging. In this paper, tractable models that are suited for real-time purposes, which can quantitatively predict the cantilever motion and the thermal-sensor measurement, are presented. Furthermore, it is demonstrated that all parameters of the model can be estimated solely from thermal-sensor data. This paper also provides a comprehensive understanding of the dynamics of the thermal sensor.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/realTimeModelsElectStatiCant.pdf",
		"type": "journal",
		"catid": "afm,thermal sensor",
		"publisher": "IEEE",
		"year": "2010",
		"pages": "83-98",
		"number": "1",
		"volume": "19",
		"journal": "Journal of Microelectromechanical Systems",
		"author": ["Agarwal, P.", "Sahoo, D.R.", "Sebastian, A.", "Pozidis, H.", "Salapaka, M.V."],
		"pubId": "agarwal2010jmems",
		"title": "Real-Time Models of Electrostatically Actuated Cantilever Probes With Integrated Thermal Sensor for Nanoscale Interrogation"
	}, {
		"abstract": "Inter-symbol interference (ISI) channels with data dependent Gauss Markov noise have been used to model read channels in magnetic recording and other data storage systems. The Viterbi algorithm can be adapted for performing maximum likelihood sequence detection in such channels. However, the problem of finding an analytical upper bound on the bit error rate of the Viterbi detector in this case has not been fully investigated. Current techniques rely on an exhaustive enumeration of short error events and determine the BER using a union bound. In this work, we consider a subset of the class of ISI channels with data dependent Gauss-Markov noise. We derive an upper bound on the pairwise error probability (PEP) between the transmitted bit sequence and the decoded bit sequence that can be expressed as a product of functions depending on current and previous states in the (incorrect) decoded sequence and the (correct) transmitted sequence. In general, the PEP is asymmetric. The average BER over all possible bit sequences is then determined using a pairwise state diagram. Simulations results which corroborate the analysis of upper bound, demonstrate that analytic bound on BER is tight in high SNR regime. In the high SNR regime, our proposed upper bound obviates the need for computationally expensive simulation.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/MLsequenceDetection.pdf",
		"type": "conference",
		"catid": "theory,afm",
		"publisher": "",
		"year": "2010",
		"pages": "1-5",
		"number": "",
		"volume": "",
		"journal": "Global Telecommunications Conference (GLOBECOM 2010), 2010 IEEE",
		"author": ["Kumar, N.", "Ramamoorthy, A.", "Salapaka, M."],
		"pubId": "mlsequencedetection",
		"title": "Performance Evaluation for ML Sequence Detection in ISI Channels with Gauss Markov Noise"
	}, {
		"abstract": "Nano-imaging has played a vital role in biology, chemistry and physics as it enables interrogation of material with sub-nanometer resolution. Primary means of achieving such atomic scale interrogation of matter are based on the principles of atomic force microscopy (AFM) and scanning tunneling microscopy (STM). However, current nano-imaging techniques are too slow to be useful in the high speed applications of interest such as studying the evolution of certain biological processes over time that involve very small time scales. In this work, we present a high speed one-bit imaging technique using dynamic mode AFM with a high quality factor cantilever. We model the high quality factor cantilever system using a Markovian model which incorporates the inherent system memory due to the inter-symbol interference and the cantilever state. Next, we pose the imaging problem as one of finding the maximum a posteriori (MAP) symbol detector for this model. This is solved by adapting the BCJR algorithm for our channel model. Furthermore, we propose an improved MAP symbol detector that incorporates a learned prior from the previous scan line while detecting the features on the current scan line. Experimental results demonstrate that our proposed algorithm provides significantly better image resolution compared to current nano-imaging techniques at high scanning speed.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/MAPdetectionNaveen.pdf",
		"type": "conference",
		"catid": "theory,afm",
		"publisher": "",
		"year": "2010",
		"pages": "1807-1811",
		"number": "",
		"volume": "",
		"journal": "Signals, Systems and Computers (ASILOMAR), 2010 Conference Record of the Forty Fourth Asilomar Conference on",
		"author": ["Kumar, N.", "Saraswat, G.", "Agarwal, P.", "Ramamoorthy, A.", "Salapaka, M."],
		"pubId": "mapdetectionnaveen",
		"title": "High-speed nano-imaging using dynamic mode AFM: A MAP detection approach"
	}, {
		"abstract": "In this article, a switching gain proportional-integral-differential controller is used to reduce probe-loss affected regions in an image, obtained during tapping mode operation. Switching signal is derived from the �reliability index� signal, which demarcates regions where the tip has lost contact with the sample (probe-loss), within couple of cantilever oscillation cycles, thereby facilitating use of higher than optimal controller gain without deteriorating on-sample performance. Efficacy of the approach is demonstrated by imaging calibration sample at tip velocity close to 240 micrometer per second and plasmid DNA at tip velocity of 60 micrometer per second indicating significant reduction of probe-loss areas and recovery of lost sample features",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/reducePrbLoss.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "",
		"year": "2009",
		"pages": "103701",
		"number": "",
		"volume": "80",
		"journal": "Review of Scientific Instruments",
		"author": ["Agarwal, P.", "De, T.", "Salapaka, M.V."],
		"pubId": "agarwal2009prblossreduc",
		"title": "Real time reduction of probe-loss using switching gain controller for high speed atomic force microscopy"
	}, {
		"abstract": "Lur'e systems, that are described by the feedback interconnection of a linear time invariant system and a nonlinear system, form an important class of nonlinear systems arising in many modern applications. A number of absolute stability criteria are available where the stability is guaranteed with the nonlinearity restricted to a pre-specified set. Most of these criteria provide sufficient conditions for absolute stability, thus lessening the conservativeness remains a challenge. A method of reducing conservativeness is to first estimate the part of the nonlinearity that is appropriate from an asymptotic sense followed by the application of a preferred absolute stability criteria to the more restricted nonlinearity. A comprehensive framework that incorporates the above approach is developed in this paper that employs a methodology based on integral quadratic constraints as a means of describing the nonlinearity. It is shown that the developed framework can be used to conclude absolute stability of Lur'e interconnections where all of the existing criteria fail to be satisfied. Indeed, examples are provided where the nonlinearity does not fall into the classes assumed by existing absolute criteria. Another contribution of the article is the extension of IQC theory.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/LessConservativCriteria.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2009",
		"pages": "113-118",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 2009. ACC '09.",
		"author": ["Materassi, D.", "Salapaka, M.V."],
		"pubId": "lessconservativcriteria",
		"title": "Less conservative absolute stability criteria using Integral Quadratic Constraints"
	}, {
		"abstract": "This article tackles the problem of estimating the domain of attraction of a Lur'e system, that is the feedback interconnection of a linear time-invariant system with a memoryless static operator. When the dimension of the system is large, numerical approaches based on simulations become prohibitive from a computational point of view. On the other hand, classical analytical techniques based on Lyapunov functions provide conservative estimates because they usually consider quadratic Lyapunov functions. Another limit is given by the fact that they deal with contractively invariant sets, which are sets where the derivative of the Lyapunov function along the trajectories is negative. Methods to reduce their conservativeness are still a challenging subject of research and desirable for many practical applications. In this paper, we try to combine the information given by more Lyapunov functions together in order to enlarge the estimate of the domain of attraction. The novelty of our approach lies in the fact that the sets we are considering are invariant but not necessarily contractively invariant. We assume that an estimate of the attraction domain is already known. In order to show that a set is part of the attraction domain, it is sufficient to prove that all the trajectories starting from it reach the current estimate in a finite time. This concept provides a method to iteratively improve the attraction domain estimate using different Lyapunov functions without limiting the analysis to contractively invariant sets. After developing a general theory, we only resort to the use of quadratic Lyapunov functions because of the computational appeal given by LMI solvers.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/AttractionDomainLyapunov.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2009",
		"pages": "4007-4012",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 2009. ACC '09.",
		"author": ["Materassi, D.", "Salapaka, M.V."],
		"pubId": "attractiondomainlyapunov",
		"title": "Attraction domain estimates combining lyapunov functions"
	}, {
		"abstract": "In this article, a method of imaging is developed, where during tapping-mode operation, equivalent resonant frequency and quality factor can be obtained in real time. It involves exciting the cantilever near its resonant frequency and two other frequencies chosen close to the resonant frequency. It is shown that changes in equivalent cantilever parameters can be registered for topography changes that are less than 1 nm in height and within 400 microsecond of the change occurring. The estimation time is two orders of magnitude better than current techniques.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/reepAfm.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "AIP",
		"year": "2009",
		"pages": "083113",
		"number": "8",
		"volume": "95",
		"journal": "Applied Physics Letters",
		"author": ["Agarwal, P.", "Salapaka, M.V."],
		"pubId": "agarwal2009reep",
		"title": "Real time estimation of equivalent cantilever parameters in tapping mode atomic force microscopy"
	}, {
		"abstract": "A prevalent mode of optical tweezers involves position clamping that regulates a constant position of a trapped bead. Traditional schemes employ the measured bead position in the open loop or the control signal in the position-clamp mode as an estimate of external force on the trapped bead. This article shows that traditional methods introduce fundamental limitations on bandwidth of the external force estimation. A method is presented that leads to an order of magnitude increase in the bandwidth of the external force estimation. Furthermore, a comprehensive modeling paradigm is introduced that facilitates estimation of forces on the bead.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/highBandwidthForceEstimOT.pdf",
		"type": "journal",
		"catid": "optical tweezers",
		"publisher": "AIP",
		"year": "2009",
		"pages": "153114-153114",
		"number": "15",
		"volume": "94",
		"journal": "Applied Physics Letters",
		"author": ["Sehgal, H.", "Aggarwal, T.", "Salapaka, M.V."],
		"pubId": "sehgal2009ot",
		"title": "High bandwidth force estimation for optical tweezers"
	}, {
		"abstract": "We consider the cantilever beam model proposed in the seminal paper of Sader, where fluid damping effects on an oscillating cantilever are modeled. We show that in Sader's model, the transfer function of base-to-tip displacement fails to display high-frequency roll-off. It turns out that this is also true for the widely-used viscous damped beam model. We further demonstrate that the addition of Voigt damping to Sader's model creates the high frequency roll-off expected of a realistic model.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/DampingMechanismsMakan.pdf",
		"type": "conference",
		"catid": "theory,afm",
		"publisher": "",
		"year": "2009",
		"pages": "2272-2277",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 2009. ACC '09.",
		"author": ["Fardad, M.", "Jovanovic, M.R.", "Salapaka, M.V."],
		"pubId": "dampingmechanismsmakan",
		"title": "Damping mechanisms in dynamic mode atomic force microscopy applications"
	}, {
		"abstract": "Microcantilevers that thermally sense the topography of the sample with the ability of electrostatic actuation enable a highly parallel implementation where multiple cantilevers scan the media. Microcantilevers with integrated sensors are used for a variety of applications viz. calorimetry, thermal dip pen lithography, thermal metrology, room temperature chemical vapor deposition in addition to high density data storage application. The dynamics of these cantilevers is governed by a complex interplay of mechanical, thermal, electrostatic and interatomic forces. Such dynamics are analyzed in this paper for operating conditions that are practical for high density data storage applications (Â¿ Tb=in2) and imaging. Models for a thermo-mechanical cantilever that are tractable for real-time applications as well as a comprehensive characterization of the relevant physical effects and methods for identifying model parameters are developed. The efficacy of the paradigm developed is proven by a comparison with experimental data.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/ElectrostaticallyActuatedMicrocantilever.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "2008",
		"pages": "2624-2630",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 2008. CDC 2008. 47th IEEE Conference on",
		"author": ["Agarwal, P.", "Sahoo, D.", "Sebastian, A.", "Pozidis, H.", "Salapaka, M.V."],
		"pubId": "electrostaticallyactuatedmicrocantilever",
		"title": "Modeling and identification of the dynamics of electrostatically actuated microcantilever with integrated thermal sensor"
	}, {
		"abstract": "Probe based data storage is a promising solution for satisfying the demand for ultra-high capacity storage devices. One of the main problems with probe storage devices is the wear of tip and media over the lifetime of the device. In this paper we present the dynamic mode operation of the cantilever probe that partially addresses the problems of media/tip wear. A communication system model which incorporates modeling of the cantilever interaction with media is proposed for the system. We demonstrate that by using a controllable canonical state space representation, the entire system can be visualized as a channel with a single input which is the tip-media interaction force. A hypothesis testing formulation for bit-by-bit detection is developed. We present three different classes of detectors for this hypothesis test. In particular, we consider two different cases where statistics on the tip-medium interaction are available and not available. Simulation results are presented for all these detectors and their relative merits are explored.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/ChannelModelingNaveen.pdf",
		"type": "conference",
		"catid": "afm,theory",
		"publisher": "",
		"year": "2008",
		"pages": "1273-1278",
		"number": "",
		"volume": "",
		"journal": "Information Sciences and Systems, 2008. CISS 2008. 42nd Annual Conference on",
		"author": ["Kumar, N.", "Agarwal, P.", "Ramamoorthy, A.", "Salapaka, M.V."],
		"pubId": "channelmodelingnaveen",
		"title": "Channel modeling and detector design for dynamic mode high density probe storage"
	}, {
		"abstract": "A new class of models based on hysteresis functions is developed to describe the operation of dynamic mode atomic force microscopy. Such models can account for dissipative phenomena affecting the interaction between the probe and the sample. The model analysis, which is developed using frequency domain techniques, provides a insights into experimentally observed behavior. Experimental data corroborates the models developed.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/hystMdlsDynAfm.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "",
		"year": "2008",
		"pages": "97-306",
		"number": "4",
		"volume": "54",
		"journal": "Nonlinear Dynamics",
		"author": ["Basso, M.", "Materassi, D.", "Salapaka, M.V."],
		"pubId": "basso2007hysteresis",
		"title": "Hysteresis Models of Dynamic Mode Atomic Force Microscopes: Analysis and Identification"
	}, {
		"abstract": "This article describes new perspectives on SPM-related science and technology, based on systems and control theory. These perspectives have led to a better understanding of SPM technology, overcome hurdles that limited the efficacy of SPM, and resulted in new modes of SPM-based interrogation. ThNcAFM, based on systems principles, has made it possible to image with resolution as high as 0.25 Aring in ambient conditions. The orders-of-magnitude improvements achieved in areas such as precision positioning, sample imaging, and sample detection rates emphasize the potential of systems tools in nanotechnology. The concept of using models in online operation has significant potential for SPM. For instance, TF-AFM, which uses models for online operation, resolves competing objectives of high resolution and detection rate by using a design from a systems perspective that makes detection bandwidth independent of the quality factor of the probe and, therefore, independent of resolution. The systems perspective also facilitates the interpretation of data since it provides a precise means for delineating the effects of the inherent dynamics of the interrogation system from the properties of the sample being probed. Devices such as SPMs are sensitive to operating conditions, ambient conditions, and modeling inaccuracies. Modern control theory provides a framework where such challenges can be effectively addressed. This aspect translates to reliable experiments in terms of repeatability, which is crucial in many nanoscience studies.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/spmAcontrolsPersp.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "IEEE",
		"year": "2008",
		"pages": "65-83",
		"number": "2",
		"volume": "28",
		"journal": "Control Systems Magazine, IEEE",
		"author": ["Salapaka, S.M.", "Salapaka, M.V."],
		"pubId": "salapakasafmcsm2008",
		"title": "Scanning probe microscopy"
	}, {
		"abstract": "Feedback enhanced optical tweezers, based on Proportional and Integral (PI) control, are routinely used for increasing the stiffness of optical traps. Digital implementation of PI controller, using DSP or FPGA, enables easy maneuverability of feedback gains. In this paper, we report occurrence of a peak in the thermal noise power spectrum of the trapped bead as the proportional gain is cranked up, which imposes a limit on how stiff a trap can be made using position feedback. We explain the reasons for the deviant behavior in the power spectrum and present a mathematical formula to account for the anomaly, which is in very good agreement with the experimental observations. Further, we present a new method to do the closed loop system identification of feedback enhanced optical tweezers by applying a frequency chirp. The system model thus obtained greatly predicts the closed loop behavior of our feedback based optical tweezers system.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/sehgal2008systems.pdf",
		"type": "conference",
		"catid": "optical tweezers",
		"publisher": "International Society for Optics and Photonics",
		"year": "2008",
		"pages": "703821-703821",
		"number": "",
		"volume": "",
		"journal": "NanoScience+ Engineering",
		"author": ["Sehgal, H.", "Aggarwal, T.", "Salapaka, M.V."],
		"pubId": "sehgal2008systems",
		"title": "Systems approach to identification of feedback enhanced optical tweezers"
	}, {
		"abstract": "Atomic force microscopes (AFMs) are the primary investigation systems at the nanoscale. In existing dynamic mode AFM methods steady-state response of microcantilever is monitored for imaging tip-surface interaction forces at the nano-scale. In these methods microcantilevers with high quality factor are employed for high force sensitivity but at the cost of speed due to dependence on steady-state signals. In this paper, a novel methodology for fast interrogation of material that exploits the transient part of the cantilever response is presented. This method effectively addresses the perceived fundamental limitation on bandwidth due to high quality factors. Analysis and experiments show that the method results in significant increase in bandwidth and resolution as compared to the steady-state-based methods. This paper demonstrates the effectiveness of a systems perspective to the field of imaging at the nano-scale and for the first time reports real-time imaging at the nanoscale using the transient method with scan speed 40 times faster than conventional methods.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/TFAFM.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "2007",
		"pages": "2135-2140",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 2007. ACC '07",
		"author": ["Sahoo, D.R.", "Agarwal, P.", "Salapaka, M.V."],
		"pubId": "tfafm",
		"title": "Transient Force Atomic Force Microscopy: A New Nano-Interrogation Method"
	}, {
		"abstract": "Characterization of optical tweezer system involves determining the stiffness coefficient of the trap and the range in which it behaves as a linear spring. This is often done by calculating the power spectrum of the fluctuations of the trapped bead observed on a photodetector. The detection process entails observing the deflection of either the same trapping beam or a different laser beam of very low power. We present a new approach where a laser beam from a source is split into s- and p-polarizations where s-polarization is used for trapping and p-polarization for detection. We also analyze and experimentally verify the effect of the detection beam on the trap dynamics. We further explain how to incorporate the effect of a strong detection beam, capable of trapping beads, in the photodetector calibration in a dual beam trap scenario. The novel detection method and the associated modelling sets the stage for the application of modern control approach.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/DualBeamOpticalTweezers.pdf",
		"type": "conference",
		"catid": "optical tweezers",
		"publisher": "",
		"year": "2007",
		"pages": "4234-4239",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 2007. ACC '07",
		"author": ["Sehgal, H.", "Aggarwal, T.", "Salapaka, M."],
		"pubId": "dualbeamopticaltweezers",
		"title": "Characterization of Dual Beam Optical Tweezers System Using a Novel Detection Approach"
	}, {
		"abstract": "In this paper, we report a novel approach to functionalize the tip of a micro-cantilever by selectively positioning a functionalized polystyrene bead using optical tweezers as a lever arm. We present a design that consists of an Atomic Force Microscope (AFM) combined with an optical tweezers setup to study specific interactions between complementary protein molecules. A BSA protein coated polystyrene bead, held stationary in an optical trap, is chemically grafted to AFM cantliever tip functionalized by the complementary protein- anti BSA. This arrangement also provides a flexible means of reversibly and irreversibly fusing polystyrene beads thermally at desired specified locations on the micro-cantilever, by heating the silicon tip with the focused laser beam of the optical tweezers. We use optical tweezers as a micro-manipulation tool for grafting pre-specified number of beads to cantilever in a controlled fashion as against the other widely used methods where an aggregate of molecules are chemically attached. Further, we study the changes in cantilever's resonant frequency and find it in good agreement with the expected change due to the additional bead mass. This study opens up opportunities in the area of biosensors by providing a method to standardize the calibration of chemically modified cantilevers",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/sehgal2007micro.pdf",
		"type": "conference",
		"catid": "afm,optical tweezers",
		"publisher": "International Society for Optics and Photonics",
		"year": "2007",
		"pages": "66441L-66441L",
		"number": "",
		"volume": "",
		"journal": "NanoScience+ Engineering",
		"author": ["Sehgal, H.", "De, T.", "Nettikadan, S.", "Salapaka, M.V."],
		"pubId": "sehgal2007micro",
		"title": "Micro-manipulation using combined optical tweezers and atomic force microscope"
	}, {
		"abstract": "The atomic force microscope (AFM) is one of the foremost tools for imaging, measuring and manipulating matter at the nanoscale. This brief presents a review of the systems and control approach to analyzing the challenging dynamic-mode operation of the AFM. A Lure system perspective of the AFM dynamics facilitates the application of powerful tools from systems theory for the analysis. The harmonic balance method provides significant insights into the steady-state behavior as well as a framework for identifying the tip-sample interaction force. A simple piecewise-linear tip-sample interaction model and its identification using the harmonic balance method is presented. The dominant first harmonic is analyzed using multivalued frequency responses and the corresponding stability conditions. The ability of the simple tip-sample interaction model to capture the intricate nonlinear behavior of the first harmonic is demonstrated. This also points to the importance of studying the higher harmonics to obtain finer details of the tip-sample interaction. The suitability of the Lure system perspective for the analysis of the higher harmonics is demonstrated.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/reviewSystemApproachDynMod.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "IEEE",
		"year": "2007",
		"pages": "952-959",
		"number": "5",
		"volume": "15",
		"journal": "IEEE Transactions on Control Systems Technology",
		"author": ["Sebastian, A.", "Gannepalli, A.", "Salapaka, M.V."],
		"pubId": "sebastian2007review",
		"title": "A review of the systems approach to the analysis of dynamic-mode atomic force microscopy"
	}, {
		"abstract": "In this letter, a real-time methodology is developed to determine regions of dynamic atomic force microscopy based image where the cantilever fails to be an effective probe of the sample. Conventional imaging signals such as the amplitude signal and the vertical piezoactuation signal cannot identify the areas of probe loss. It is experimentally demonstrated that probe-loss affected portion of the image can be unambiguously identified by a real-time signal called reliability index. Reliability index, apart from indicating the probe-loss affected regions, can be used to minimize probe-loss affected regions of the image, thus aiding high speed AFM applications.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/realTimeDetectionProbeLoss.pdf",
		"type": "journal",
		"catid": "afm,probeloss",
		"publisher": "",
		"year": "2006",
		"pages": "133119",
		"number": "",
		"volume": "vol. 89",
		"journal": "Applied Physics Letters",
		"author": ["De, T.", "Agarwal, P.", "Sahoo, D. R.", "Salapaka, M. V."],
		"pubId": "realtimedetectprbloss2006",
		"title": "Real-time detection of probe loss in atomic force microscopy"
	}, {
		"abstract": "Hysteresis and constitutive nonlinearities are inherent properties of ferroelectric transducer materials due to the noncentrosymmetric nature of the compounds. In certain regimes, these effects can be mitigated through restricted input fields, charge- or current-controlled amplifiers, or feedback designs. For general operating conditions, however, these properties must be accommodated in models, transducer designs, and model-based control algorithms to achieve the novel capabilities provided by the compounds. In this paper, we illustrate the construction of inverse filters, based on homogenized energy models, which can be used to approximately linearize the piezoceramic transducer behavior for linear design and control implementation. Attributes of the inverse filters are illustrated through numerical examples and experimental open loop control implementation for an atomic force microscope stage",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/modelBasedInverseSmith06.pdf",
		"type": "journal",
		"catid": "afm,nanopositioning",
		"publisher": "IEEE",
		"year": "2006",
		"pages": "1058-1069",
		"number": "6",
		"volume": "14",
		"journal": "Control Systems Technology, IEEE Transactions on",
		"author": ["Hatch, A.G.", "Smith, R.C.", "De, T.", "Salapaka, M.V."],
		"pubId": "hatchsmith2006construction",
		"title": "Construction and experimental implementation of a model-based inverse filter to attenuate hysteresis in ferroelectric transducers"
	}, {
		"abstract": "In this paper, we use state space approach to give a sufficient condition for internal stability of the closed loop system when the centralized stabilizing controller is implemented in a distributive manner. Using this condition, we show that the centralized stabilizing controller for a 2-nest system can be split into two sub-controllers without affecting the internal stability. The effect of sub-controller to sub-controller communication noise on the performance is considered along with the constraint on strength of sub-controller to sub-controller communication signal. We take an input-output approach. In a 2-nest case, we obtain a sufficient condition for splitting the stabilizing controller such that the overall performance optimization can be cast as a convex problem in the Youla-Kucera parameter Q. We also present an architecture for distributive implementation of banded structure controllers such that all closed loop maps are affine in Q",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/yadav2006architectures.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "IEEE",
		"year": "2006",
		"pages": "6-pp",
		"number": "",
		"volume": "",
		"journal": "American Control Conference (ACC), 2006",
		"author": ["Yadav, V.", "Voulgaris, PG", "Salapaka, MV"],
		"pubId": "yadav2006architectures",
		"title": "Architectures for distributed control for performance optimization in presence of sub-controller communication noise"
	}, {
		"abstract": "In this paper, we develop nonlinear constitutive equations and resulting system models quantifying the nonlinear and hysteretic field-displacement relations inherent to lead zirconate titanate (PZT) devices employed in atomic force microscope stage mechanisms. We focus specifically on PZT rods utilizing d33 motion and PZT shells driven in d31 regimes, but the modeling framework is sufficiently general to accommodate a variety of drive geometries. In the first step of the model development, lattice-level energy relations are combined with stochastic homogenization techniques to construct nonlinear constitutive relations which accommodate the hysteresis inherent to ferroelectric compounds. Second, these constitutive relations are employed in classical rod and shell relations to construct system models appropriate for presently employed nanopositioner designs.The capability of the models for quantifying the frequency-dependent hysteresis inherent to the PZT stages is illustrated through comparison with",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/mdlAfmStageMech.pdf",
		"type": "journal",
		"catid": "afm,nanopositioning",
		"publisher": "",
		"year": "2006",
		"pages": "1998-2026",
		"number": "6",
		"volume": "66",
		"journal": "SIAM Journal on Applied Mathematics",
		"author": ["Smith, R.C.", "Hatch, A.G.", "De, T.", "Salapaka, M.V.", "Del Rosario, R.C.H.", "Raye, J.K."],
		"pubId": "smith2006model",
		"title": "Model development for atomic force microscope stage mechanisms"
	}, {
		"abstract": "Atomic force microscopes (AFMs) are devices employed in many nanotechnology fields for nanoscale imaging and surface manipulation at the atomic level. The interaction potential between the cantilever tip and the sample is typically obtained using force curves. Each force curve involves an approach and retract phase and the entire process is relatively slow. In this paper we present the non-parametric identification of the tip-sample interaction potential that has the potential to significantly reduce the time when compared to force curves",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/materassi2006identification.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "IEEE",
		"year": "2006",
		"pages": "3702-3705",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 2006 45th IEEE Conference on",
		"author": ["Materassi, D.", "Salapaka, MV", "Basso, M."],
		"pubId": "materassi2006identification",
		"title": "Identification of Interaction Potentials in Dynamic Mode Atomic Force Microscopy"
	}, {
		"abstract": "A weak form of the circle criterion for Lur'e systems is stated. The result allows prove global boundedness of all system solutions. Moreover such a result can be employed to enlarge the set of nonlinearities for which the standard circle criterion can guarantee absolute stability",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/materassi2006less.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "IEEE",
		"year": "2006",
		"pages": "4-pp",
		"number": "",
		"volume": "",
		"journal": "American Control Conference (ACC), 2006",
		"author": ["Materassi, D.", "Salapaka, M.", "Basso, M."],
		"pubId": "materassi2006less",
		"title": "A less conservative circle criterion"
	}, {
		"abstract": "In the existing dynamic-mode operation of atomic force microscopes (AFMs) steady-state signals like amplitude and phase are used for detection and imaging of material. Due to the high quality factor of the cantilever probe the corresponding methods are inherently slow. In this paper, a novel methodology for fast interrogation of material that exploits the transient part of the cantilever motion is developed. This method effectively addresses the perceived fundamental limitation on bandwidth due to high quality factors. It is particularly suited for the detection of small time scale tip�sample interactions. Analysis and experiments show that the method results in significant increase in bandwidth and resolution as compared to the steady-state-based methods. This article demonstrates the effectiveness of a systems perspective to the field of imaging at the nano-scale and for the first time reports realtime experimental results and scanning applications of the transient method.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/harnessTansSigsAFM.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "",
		"year": "2005",
		"pages": "805-820",
		"number": "",
		"volume": "15",
		"journal": "International Journal of Robust and Nonlinear Control",
		"author": ["Sahoo, D. R.", "Sebastian, A.", "Salapaka, M. V."],
		"pubId": "tfafm2sahoo05",
		"title": "Harnessing the transient signals in atomic force microscopy"
	}, {
		"abstract": "In this letter a thermally driven frequency modulated atomic force microscopy (FM-AFM) technique is developed. Thermal fluctuations of the cantilever are employed to estimate the cantilever�s equivalent resonant frequency. The corresponding cantilever oscillations are the smallest possible at a given temperature. Related experiments that establish the feasibility of thermally driven FM-AFM in ambient room conditions have achieved tip-sample separations less than 2 nm with long term separation stability (greater than 30 min). Employing this method a narrowband 250 Hz modulation of the tip-sample separation was detected with a vertical resolution of 0.25 � in a 0.4 Hz bandwidth. The corresponding estimated force sensitivity is 7 fN. In all experiments the cantilever tip was maintained in the attractive regime of the tip-sample interactions. This demonstrates a thermally driven non-contact mode operation of AFM. It also provides a limits of performance study of small amplitude FM-AFM methods.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/thermallyDrivNcAFM.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "AIP",
		"year": "2005",
		"pages": "111901",
		"number": "11",
		"volume": "87",
		"journal": "Applied Physics Letters",
		"author": ["Gannepalli, Anil", "Sebastian, Abu", "Cleveland, Jason", "Salapaka, Murti"],
		"pubId": "thncafmgannepalli05",
		"title": "Thermally driven non-contact atomic force microscopy"
	}, {
		"abstract": "In atomic force microscopy, bandwidth or resolution can be affected by active quality factor (Q) control. However, in existing methods the trade off between resolution and bandwidth remains inherent. Observer based Q control method provides greater flexibility in managing the tradeoff between resolution and bandwidth during imaging. It also facilitates theoretical analysis lacking in existing methods. Steady state signals like amplitude and phase are slowly varying variables that are suited to image low bandwidth content of the actual sample profile. Observer based transient imaging scheme with Q control has the promise of detecting high bandwidth content of the sample features during scanning. Transient detection also has the advantage of high sensitivity to small features",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/sahoo2005observer.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "IEEE",
		"year": "2005",
		"pages": "1185-1190",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 2005 and 2005 European Control Conference. CDC-ECC'05. 44th IEEE Conference on",
		"author": ["Sahoo, D.R.", "De Murti, T.", "Salapaka, V."],
		"pubId": "sahoo2005observer",
		"title": "Observer based imaging methods for Atomic Force Microscopy"
	}, {
		"abstract": "The paper addresses the problem of evaluating magnitude bounds on higher harmonics of the periodic tip oscillation in an Atomic Force Microscope (AFM). The suggested approach considers a class of nonlinearities well suited to the tip-sample interaction in AFMs, and reduces the bounding problem to an optimization problem. For a relaxation of the problem a solution in a closed form is provided and reduces the conservativeness of estimates existing in literature",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/materassi2005harmonic.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "IEEE",
		"year": "2005",
		"pages": "8221-8226",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 2005 and 2005 European Control Conference. CDC-ECC'05. 44th IEEE Conference on",
		"author": ["Materassi, D.", "Salapaka, M.", "Basso, M."],
		"pubId": "materassi2005harmonic",
		"title": "Harmonic Bounds in Atomic Force Microscopy"
	}, {
		"abstract": "In this paper we address the problem of synthesizing controllers that have to be implemented distributively and have structure. The effect of sub-controller to sub-controller communication noise on stability and performance is considered. Using an observer based controller parameterization, we provide suitable stabilizing sub-controller architectures that directly take into account the effect of communication noise on performance. In particular, the overall performance optimization can be cast as a convex problem in the Youla-Kucera parameter Q. Similar results hold for banded controller structures, i.e., when there is also a delay in the subsystem to subsystem communication",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/yadav2005distributed.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "IEEE",
		"year": "2005",
		"pages": "1119-1124",
		"number": "",
		"volume": "",
		"journal": "Intelligent Control, 2005. Proceedings of the 2005 IEEE International Symposium on, Mediterrean Conference on Control and Automation",
		"author": ["Yadav, V.", "Voulgaris, PG", "Salapaka, MV"],
		"pubId": "yadav2005distributed",
		"title": "Distributed architectures and implementations of observer based controllers for performance optimization"
	}, {
		"abstract": "In this paper, the design of controllers that incorporate structural and multiobjective performance requirements is considered. The control structures under study cover nested, chained, hierarchical, delayed interaction and communications, and symmetric systems. Such structures are strongly related to several modern-day and future applications including integrated flight propulsion systems, platoons of vehicles, micro-electro-mechanical systems, networked control, control of networks, production lines and chemical processes. It is shown that the system classes presented have the common feature that all stabilizingcontrollers can be characterized by convex constraints on the Youla�Kucera parameter. Using this feature, a solution to a general optimal performance problem that incorporates time domain and frequency domain constraints is obtained. A synthesis procedure is provided which at every step yields a feasible controller together with a measure of its performance with respect to the optimal. Convergence to the optimal performance is established. An example of a multinode network congestion control problem is provided that illustrates the effectiveness of the developed methodology.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/structureOptRobustCntrl.pdf",
		"type": "journal",
		"catid": "control theory, multiobjective, structured",
		"publisher": "IEEE",
		"year": "2004",
		"pages": "1623-1640",
		"number": "10",
		"volume": "49",
		"journal": "IEEE Transactions on Automatic Control",
		"author": ["Qi, X.", "Salapaka, M.V.", "Voulgaris, P.G.", "Khammash, M."],
		"pubId": "qi2004structured",
		"title": "Structured optimal and robust control with multiple criteria: A convex solution"
	}, {
		"abstract": "Micro-cantilever based devices have revolutionized imaging and they are the primary tools for investigation and control of matter at the nanoscale. In certain applications like single electron spin detection, it is essential to maintain a sub-nanometer tip-sample separation for extended periods of time. The existing techniques of atomic force microscope (AFM) operation are not suited for such applications. In this paper a novel approach based on the thermal noise response of the cantilever is developed that promises to meet the aforementioned challenges. The presented technique exploits the dependence of the tip-sample separation and cantilever's resonant frequency to maintain a small tip-sample separation by regulating the effective resonant frequency. The resonant frequency is estimated from cantilever's response to the thermal noise forcing. The experiments performed in ambient room conditions have achieved tip-sample separations as small as 1.5 nm for time periods in excess of 30 min.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/yadav2005distributed.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2004",
		"pages": "3122-3127",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 2004.",
		"author": ["Gannepalli, A.", "Sebastian, A.", "Cleveland, J.P.", "Salapaka, M.V."],
		"pubId": "yadav2005distributedl",
		"title": "Thermal noise response based control of tip-sample separation in AFM"
	}, {
		"abstract": "The first harmonic of the cantilever deflection in the tapping-mode operation of an atomic force microscope (AFM) is analyzed using asymptotic methods for weakly nonlinear oscillators. The resulting amplitude and phase dynamical equations are obtained which characterize the transient behavior of tapping-mode dynamics. The steady state behavior is analyzed by examining the fixed points of the amplitude phase dynamics and a simple stability criterion is obtained. Further with a simple tip-sample interaction model, the experimentally observed discontinuous jumps in the amplitude versus tip-sample separation plots are explained and the regions of the interaction regime probed by the tip are investigated.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/seb2004amp.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "2004",
		"pages": "2132-2137",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 2004.",
		"author": ["Sebastian, A.", "Gannepalli, A.", "Salapaka, M.V."],
		"pubId": "seb2004amp",
		"title": "The amplitude phase dynamics and fixed points in tapping-mode atomic force microscopy"
	}, {
		"abstract": "In dynamic mode operation of atomic force microscopes steady state signals like amplitude and phase are typically used for the detection and imaging of sample. Due to the high quality factor of the micro-cantilever probe the corresponding methods are inherently slow. In this paper we present a novel methodology for fast interrogation of sample that exploits the transient signals. A novel method is introduced for the detection of small time scale tip-sample interactions. Simulations and experiments show that the method results in significant increase in bandwidth and resolution as compared to the steady state data based methods.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/seb2003observer.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "2003",
		"pages": "2132-2137",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 2003. Proceedings of the 42nd IEEE Conference on",
		"author": ["Sebastian, A.", "Sahoo, D.R.", "Salapaka, M.V."],
		"pubId": "seb2003observer",
		"title": "An observer based sample detection scheme for atomic force microscopy"
	}, {
		"abstract": "The imaging problem using an atomic force microscope (AFM) is addressed in the framework of modern robust control. Subsequently stacked H infin; and Glover McFarlane controllers are designed for high bandwidth and robustness. It is postulated that the sample profile can be accurately imaged without building explicit observers. Experimental results substantiate this claim.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/seb2003robust.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "2003",
		"pages": "3443-3444",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 2003. Proceedings of the 42nd IEEE Conference on",
		"author": ["Sebastian, A.", "Salapaka, M.V.", "Cleveland, J.P."],
		"pubId": "seb2003robust",
		"title": "Robust control approach to atomic force microscopy"
	}, {
		"abstract": "This paper addresses the design of stabilizing controllers for a nested control system where the controller is realized in a distributed manner, considering uncertainty not only in the controller-to-plant and plant-to-controller channels but also in the nest-to-nest, subcontroller-to-subcontroller communication. An input-output approach is taken. Two appropriate controller architectures that stabilize the entire system with the various components subject to uncertainty and noise are addressed. We present controller synthesis procedures to address deterministic uncertainty and stochastic uncertainty, that model packet-loss in the Internet.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/yadav2003nested.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2003",
		"pages": "2853-2858",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 2003. Proceedings of the 42nd IEEE Conference on",
		"author": ["Yadav, V.", "Voulgaris, P.G.", "Salapaka, M.V."],
		"pubId": "yadav2003nested",
		"title": "Stabilization of nested systems with uncertain subsystem communication channels"
	}, {
		"abstract": "In this paper the design of controllers that incorporate structural and multiobjective performance requirements is considered. The control structures under study cover nested, chained, hierarchical, delayed interaction and communications, and symmetric systems. Such structures are strongly related to several modern-day and future applications including integrated flight propulsion systems, platoons of vehicles, micro-electromechanical systems, networked control, control of networks, production lines and chemical processes. It is shown that the system classes presented have the common feature that all stabilizing controllers can be characterized by convex constraints on the Youla-Kucera parameter. Using this feature, a solution to a general optimal performance problem that incorporates time domain and frequency domain constraints is obtained. A synthesis procedure is provided which, at every step, yields a feasible controller together with a measure of its performance with respect to the optimal performance. Convergence to the optimal performance is established. An example of a multi-node network congestion control problem is provided that illustrates the effectiveness of the developed methodology..",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/qi2003network.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2003",
		"pages": "272-277",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 2003.",
		"author": ["Qi, Xin", "Salapaka, M.V.", "Voulgaris, P.G.", "Khammash, M."],
		"pubId": "qi2003network",
		"title": "Structured optimal control with applications to network flow coordination"
	}, {
		"abstract": "In typical dynamic mode operation of atomic force microscopes, steady state signals like amplitude and phase are used for detection and imaging of material. In these methods, the resolution and bandwidth are dictated by the quality factor (Q) of the cantilever. In this letter, we present a methodology that exploits the deflection signal during the transient of the cantilever motion. The principle overcomes the fundamental limitations on the trade off between resolution and bandwidth present in existing methods and makes it independent of the quality factor. Experimental results provided corroborate the theoretical development",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/transSigBaedSampDet.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "",
		"year": "2003",
		"pages": "5521",
		"number": "26",
		"volume": "83",
		"journal": "Applied Physics Letters",
		"author": ["Sahoo, D. R.", "Sebastian, A.", "Salapaka, M. V."],
		"pubId": "tfafm03",
		"title": "Transient-signal-based sample-detection in atomic force microscopy"
	}, {
		"abstract": "Several methods have been developed for joint working and spare capacity planning in survivable wavelength-division-multiplexing (WDM) networks. These methods have considered a static traffic demand and optimized the network cost assuming various cost models and survivability paradigms. Our interest primarily lies in network operation under dynamic traffic. We formulate various operational phases in survivable WDM networks as a single integer linear programming (ILP) optimization problem. This common framework avoids service disruption to the existing connections. However, the complexity of the optimization problem makes the formulation applicable only for network provisioning and offline reconfiguration. The direct use of this method for online reconfiguration remains limited to small networks with few tens of wavelengths. Our goal in this paper is to develop an algorithm for fast online reconfiguration. We propose a heuristic algorithm based on LP relaxation technique to solve this problem. Since the ILP variables are relaxed, we provide a way to derive a feasible solution from the relaxed problem. The algorithm consists of two steps. In the first step, the network topology is processed based on the demand set to be provisioned. This preprocessing step is done to ensure that the LP yields a feasible solution. The preprocessing step in our algorithm is based on: (a) the assumption that in a network, two routes between any given node pair are sufficient to provide effective fault tolerance and (b) an observation on the working of the ILP for such networks. In the second step, using the processed topology as input, we formulate and solve the LP problem. Interestingly, the LP relaxation heuristic yielded a feasible solution to the ILP in all our experiments. We provide insights into why the LP formulation yields a feasible solution to the ILP We demonstrate the use of our algorithm on practical size backbone networks with hundreds of wavelengths per link. The results indicate that the run time of our heuristic algorithm is fast enough (in order of seconds) to be used for online reconfiguration",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/PracticalApproachSurvivableWDM.pdf",
		"type": "journal",
		"catid": "networks,theory",
		"publisher": "IEEE",
		"year": "2002",
		"pages": "34-46",
		"number": "1",
		"volume": "20",
		"journal": "Selected Areas in Communications, IEEE Journal on",
		"author": ["Sridharan, M.", "Salapaka, M.V.", "Somani, A.K."],
		"pubId": "sridharan2002practical",
		"title": "A practical approach to operating survivable WDM networks"
	}, {
		"abstract": "This article presents the design, identification, and control of a nano-positioning device suited to image biological samples as part of an atomic force microscope. The device is actuated by a piezoelectric stack and its motion is sensed by a linear variable differential transformer. It is demonstrated that the conventional proportional-integral control architecture does not meet the bandwidth requirements for positioning. The design and implementation of an Hinfinity controller demonstrates substantial improvements in the positioning speed and precision, while eliminating the undesirable nonlinear effects of the actuator. The characterization of the resulting device in terms of bandwidth, resolution, and repeatability provided illustrates the effectiveness of the modern robust control",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/highBandwidthNanoPos.pdf",
		"type": "journal",
		"catid": "afm,nanopositioning",
		"publisher": "",
		"year": "2002",
		"pages": "3232-3241",
		"number": "",
		"volume": "73",
		"journal": "Review of Scientific Instruments",
		"author": ["Salapaka, S.", "Sebastian, A.", "Cleveland, J. P.", "Salapaka, M. V."],
		"pubId": "salapakascs02",
		"title": "High Bandwidth Nano-positioner: A Robust Control Approach"
	}, {
		"abstract": "",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/missingLink.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "2002",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "Proceedings of the Allerton Conference",
		"author": ["D. Sahoo, A. Sebastian, M. V. Salapaka"],
		"pubId": "sahootrasientalerton",
		"title": "Transient Detection of Atomic Force Microscopy"
	}, {
		"abstract": "In this paper, the integrated parameter and control (IPC) problem is considered where the system parameters are assumed to enter into the state-space realization in a polynomial manner. Converging finite-dimensional sub-optimal problems are constructed and solved via a linear relaxation technique, whereby a global optimal solution to the IPC problem can be computed to any prescribed tolerance",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/qi2002integrated.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "IEEE",
		"year": "2002",
		"pages": "4888-4893",
		"number": "",
		"volume": "6",
		"journal": "American Control Conference (ACC), 2002",
		"author": ["Qi, X.", "Khammash, M.H.", "Salapaka, M.V."],
		"pubId": "qi2002integrated",
		"title": "Integrated parameter and control design"
	}, {
		"abstract": "Distributed averaging over a large network is a well studied problem that converges asymptotically; however, existing protocols does not provide a way for each node to distributively detect the occurrence of convergence. In this paper a method is developed to distributively determine when the consensus has reached within a given error margin. In absence of such a method all nodes in the network keep running the required computation and communication even if the consensus value are within acceptable tolerance, which is not preferable as in large-scale distributed networks resources like power are limited. Furthermore, this extra communication can cause signal interference with other critical information. This distributed detection takes finite time and occurs at each node simultaneously.",
		"highlights": "conferenceArticles/yadav2007distributed.pdf",
		"pdflink": "conferenceArticles/yadav2007distributed.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2007",
		"pages": "715-720",
		"number": "",
		"volume": "6",
		"journal": "45th Annual Allerton Conf",
		"author": ["Yadav, Vikas","Salapaka, M.V."],
		"pubId": "yadav2007distributed",
		"title": "Distributed protocol for determining when averaging consensus is reached"
	}, {
		"abstract": "This paper focuses on the development of constitutive models, commensurate system models, and inverse compensator construction for high speed nanopositioning in atomic force microscopes (AFM). All current AFM employ either stacked or cylindrical piezoceramic actuators for both longitudinal and transverse positioning of the sample. An inherent property of these materials is the presence of hysteresis and constitutive nonlinearities, even at the low drive levels employed for angstrom-level resolution. At low frequencies, standard feedback mechanisms effectively attenuate the hysteresis, whereas noise at high frequencies diminishes the efficacy of feedback and leads to unacceptable accuracy. In this paper, we discuss modeling techniques which provide a first step toward high speed nanopositioning for applications ranging from macroscopic product evaluation to real-time imaging of biological processes.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/smith2002model.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "2002",
		"pages": "3652-3657",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 2002. Proceedings of the 41st IEEE Conference on",
		"author": ["Smith, R.C.", "Salapaka, M.V.", "Hatch, A.", "Smith, J.", "De, T."],
		"pubId": "smith2002model",
		"title": "Model development and inverse compensator design for high speed nanopositioning"
	}, {
		"abstract": "Most real-time scheduling algorithms are open-loop algorithms as the scheduling decisions are based on the worst-case estimates of task parameters. In recent years, the \"closed - loop\" scheduling has gained importance due to its applicability to many real-world problems wherein the feedback information can be exploited efficiently to adjust task and/or scheduler parameters, thereby improving the system's performance. In this paper, we discuss an open-loop dynamic scheduling algorithm that employs a notion of task overlap in the scheduler in order to provide some flexibility in task execution time. Then we present a novel closed-loop approach for dynamically estimating the execution time of tasks based on both deadline miss ratio and task rejection ratio in the system. This approach is highly preferable for firm/soft real-time systems since it provides a firm performance guarantee in terms of deadline misses while achieving a high guarantee ratio. We design the proportional-integral controller and H infin; controller for closed loop scheduling. We evaluate the performance of the open-loop and the closed-loop approaches using simulation studies. We show that the closed-loop dynamic scheduling offers a better performance over the open-loop scheduling under all practical conditions.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/seb2002tapping.pdf",
		"type": "conference",
		"catid": "other",
		"publisher": "",
		"year": "2002",
		"pages": "1254-1259",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 2002.",
		"author": ["Sahoo, D.R.", "Swaminathan, S.", "Al-Omari, R.", "Salapaka, M.V.", "Manimaran, G.", "Somani, A.K."],
		"pubId": "seb2002tapping",
		"title": "Feedback control for real-time scheduling"
	}, {
		"abstract": "The feedback perspective with the cantilever viewed as a linear system and the tip-sample interaction appearing as a nonlinear feedback is useful in analyzing AFM (Atomic Force Microscope) dynamics. Conditions for the existence and stability of periodic solutions for such a system when forced sinusoidally are obtained. These results are applied to the case where the AFM is operated in the tapping-mode. The near sinusoidal nature of periodic solutions is established by obtaining bounds on the higher harmonics. The concept of Integral Quadratic Constraints (IQC) is widely used in the analysis",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/sebastian2002analysis.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2002",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "International conference on Mathematical Theory for Networks and Systems",
		"author": ["Sebastian, A.", "Salapaka, MV"],
		"pubId": "sebastian2002analysis",
		"title": "Analysis of periodic solutions in tapping-mode AFM: An IQC approach"
	}, {
		"abstract": "This paper presents the design, identification and control of a nanopositioning device. The device is actuated by a piezoelectric stack and its motion is sensed by a linear variable differential transformer (LVDT). A fourth order single input single output model has been identified to describe its dynamics. It is demonstrated that PI control law does not meet the bandwidth requirements for positioning. This motivated the design and implementation of an H infin; controller which demonstrates substantial improvements in the positioning speed and precision besides eliminating the undesirable nonlinear effects of the actuator. The characterization of the device in terms of bandwidth, resolution, and repeatability is also shown.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/salapaka2002nanopositioning.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "2002",
		"pages": "1966-1971",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 2002.",
		"author": ["Salapaka, S.", "Sebastian, A.", "Cleveland, J.P.", "Salapaka, M.V."],
		"pubId": "salapaka2002nanopositioning",
		"title": "Design, identification and control of a fast nanopositioning device"
	}, {
		"abstract": "In this paper, we consider two important objectives of network operation: (i) capacity minimization and (ii) revenue maximization. For capacity minimization, we formulate three operational phases in survivable WDM network operation viz., initial call set up, short/medium-term reconfiguration, and long-term reconfiguration. All three phases are derived from a single integer linear programming (ILP) formulation. This common framework incorporates service disruption. We modify the framework for revenue maximization that includes a service differentiation model based on lightpath protection. We propose a multistage solution methodology to solve individual service classes sequentially and combine them to obtain a feasible solution. We provide cost comparisons in terms of increase in revenue obtained by various service classes with the base case of accepting demands without any protection. Results are provided to demonstrate the effectiveness of our framework.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/approachesCapacityRevenue.pdf",
		"type": "journal",
		"catid": "networks,theory",
		"publisher": "IOS Press",
		"year": "2001",
		"pages": "109-126",
		"number": "2",
		"volume": "10",
		"journal": "Journal of High Speed Networks",
		"author": ["Sridharan, M.", "Somani, A.K.", "Salapaka, M.V."],
		"pubId": "sridharan2001approaches",
		"title": "Approaches for capacity and revenue optimization in survivable WDM networks"
	}, {
		"abstract": "In this paper we develop a method for exact constructive controllability of quantum mechanical systems. The method has three steps, first a path from the initial state to the final state is determined and intermediate points chosen such that any two consecutive points are close, next small sinusoidal control signals are used to drive the system between the points, and finally quantum measurement technique is used to exactly achieve the desired state. The methodology is demonstrated for the control of spin-half particles in a Stern-Gerlach setting",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/sahoo2001quantum.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2001",
		"pages": "1601-1606",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 2001. Proceedings of the 40th IEEE Conference on",
		"author": ["Sahoo, D.R.", "Salapaka, M.V."],
		"pubId": "sahoo2001quantum",
		"title": "Constructive control of quantum-mechanical systems"
	}, {
		"abstract": "In this paper, a MATLAB package, GMO 1.0, is introduced for synthesizing (sub-) optimal controllers for the general multiobjective (GMO) control problem involving 1 norm, ℋ2 norm, ℋ∞ norm, time-domain constraint (TDC), and controller structure constraints. The GMO framework encompasses a large class of multiobjective problems which can be effectively solved by using GMO 1.0 package (e.g. 1/ℋ∞, 1/TDC, etc.). While global convergence is guaranteed for the convex finite dimensional suboptimal problems, this set of routines yields a rational linear time-invariant controller delivering performance within any prescribed tolerance of the optimal cost. In this paper, several multiobjective design problems are solved to demonstrate the effectiveness of the framework and the software",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/murtimatlab.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2001",
		"pages": "3991-3996",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 2001. Proceedings of the 40th IEEE Conference on",
		"author": ["Qi, Xin,", "M. H. Khammash,", "Salapaka., M. V."],
		"pubId": "murtimatlab",
		"title": "A Matlab Package for Multiobjective Control Synthesis"
	}, {
		"abstract": "We present a methodology to address the general multiobjective control problem involving the 1 norm,l2 norm, l-infinity norm and time-domain constraint. We show that the problem resulting from imposing a regularizing condition always admits an optimal solution, and suboptimal solutions with performance arbitrarily close to the optimal cost can be obtained by constructing two sequences of finite dimensional convex optimization problems whose objective values converge to the optimum from below and above. A numerical example is presented to illustrate the effectiveness of the proposed methodologyWe present a methodology to address the general multiobjective control problem involving the 1 norm, l2 norm, l-infinity norm and time-domain constraint. We show that the problem resulting from imposing a regularizing condition always admits an optimal solution, and suboptimal solutions with performance arbitrarily close to the optimal cost can be obtained by constructing two sequences of finite dimensional convex optimization problems whose objective values converge to the optimum from below and above. A numerical example is presented to illustrate the effectiveness of the proposed methodology",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/qi2001optimal.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "IEEE",
		"year": "2001",
		"pages": "2730-2735",
		"number": "",
		"volume": "4",
		"journal": "American Control Conference, 2001",
		"author": ["Qi, X.", "Khammash, M.H.", "Salapaka, M.V."],
		"pubId": "qi2001optimal",
		"title": "Optimal controller synthesis with multiple objectives"
	}, {
		"abstract": "The atomic force microscope �AFM! is a powerful tool for investigating surfaces at atomic scales. Harmonic balance and power balance techniques are introduced to analyze the tapping-mode dynamics of the atomic force microscope. The harmonic balance perspective explains observations hitherto unexplained in the AFM literature. A nonconservative model for the cantilever�sample interaction is developed. The energy dissipation in the sample is studied and the resulting power balance equations combined with the harmonic balance equations are used to estimate the model parameters. Experimental results confirm that the harmonic and power balance tools can be used effectively to predict the behavior of the tapping cantilever.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/harmonicPowerBalanceAfm.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "",
		"year": "2001",
		"pages": "6473-6480",
		"number": "",
		"volume": "89 (11)",
		"journal": "Journal of Applied Physics",
		"author": ["Sebastian, A.", "Salapaka, M. V.", "Chen, D.", "Cleveland, J. P."],
		"pubId": "sebastianscc01",
		"title": "Harmonic and power balance tools for tapping-mode atomic force microscope"
	}, {
		"abstract": "In this article tapping-mode atomic force microscope dynamics is studied. The existence of a periodic orbit at the forcing frequency is shown under unrestrictive conditions. The dynamics is further analyzed using the impact model for the tip-sample interaction and a spring-mass-damper model of the cantilever. Stability of the periodic orbit is established. Closed-form expressions for various variables important in tapping-mode imaging are obtained. The linear relationship of the amplitude and the sine of the phase of the first harmonic of the periodic orbit with respect to cantilever-sample offset is shown. The study reinforces gentleness of the tappingmode on the sample. Experimental results are in excellent qualitative agreement with the theoretical predictions. The linear relationship of the sine of the phase and the amplitude can be used to infer sample properties. The comparison between the theory and the experiments indicates essential features that are needed in a more refined model.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/linearityAmpPhaseAfm.pdf",
		"type": "journal",
		"catid": "afm",
		"publisher": "",
		"year": "2000",
		"pages": "1106-1115",
		"number": "2",
		"volume": "61",
		"journal": "Phys. Rev. B.",
		"author": ["Salapaka, M. V.", "Chen, D.", "Cleveland, J. P."],
		"pubId": "linearityofampphasesal00",
		"title": "Linearity of amplitude and phase in tapping-mode atomic force microscopy"
	}, {
		"abstract": "",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/missingLink.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "2000",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "Proceedings of the 38th annual allerton conference on communication, control and computing, Allerton, Urbana, Illinois, 2000",
		"author": ["Qi, X,", "M. H. Khammash,", "Salapaka, M. V."],
		"pubId": "mvnewapproach",
		"title": "A new approach to multiple-objective controller synthesis"
	}, {
		"abstract": "Stochastic resonance is an interesting phenomenon which can occur in bistable systems subject to periodic and random forcing. This effect produces an improvement in the sensitivity of the bistable system to the periodic signal. In this paper, stochastic resonance for atomic force microscope (AFM) is studied. The experimental results indicate that the AFM can be modeled as a bistable system similar to the Schmitt trigger, for which stochastic resonance has been well studied. The results indicate that stochastic resonance in AFM can be applied in many technological contexts as, for example, in the analysis of the effects of thermal noise in order to optimize the achievable resolution for imaging.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/rajaram2000experimental.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "2000",
		"pages": "2129-2133",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 2000.",
		"author": ["Rajaram, R.", "Salapaka, MV", "Basso, M.", "Dahleh, M."],
		"pubId": "rajaram2000experimental",
		"title": "Experimental study of stochastic resonance in atomic force microscopes"
	}, {
		"abstract": "In this paper we present a methodology to obtain converging lower and upper bounds to a multiple objective problem where an H2 performance objective is minimized subject to an l1constraint. This methodology gives a computationally efficient synthesis procedure by avoiding many of the problems that are present in methods that employ zero interpolation techniques to characterize achievable closed loop maps.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/mimoH2l1withoutInterpol.pdf",
		"type": "journal",
		"catid": "control theory,multiobjective",
		"publisher": "",
		"year": "1999",
		"pages": "1865-1873",
		"number": "6",
		"volume": "37",
		"journal": "SIAM Journal on Optimization and Control",
		"author": ["Murti V. Salapaka, M. Khammash, M. Dahleh"],
		"pubId": "withoutzerointerpolsal99",
		"title": "Solution of MIMO H2/l1 problem without zero interpolation"
	}, {
		"abstract": "In this paper, we study the dynamical behavior of a microcantilever-sample system that forms the basis for the operation of atomic force microscopes (AFM). We model the microcantilever by a single mode approximation and the interaction between the sample and cantilever by a van der Waals (vdW) potential. The cantilever is vibrated by a sinusoidal input, and its detection is detected optically. We analyze the forced dynamics using Melnikov method, which reveals the region in the space of physical parameters where chaotic motion is possible. In addition, using a proportional and derivative controller we compute the Melnikov function in terms of the parameters of the controller. Using this relation it is possible to design controllers that will remove the possibility of chaos.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/dynAnalyMicroCant.pdf",
		"type": "journal",
		"catid": "afm,chaos",
		"publisher": "",
		"year": "1999",
		"pages": "1663-1670",
		"number": "",
		"volume": "35: (10)",
		"journal": "Automatica",
		"author": ["Ashhab, M.", "Salapaka, M. V.", "Dahleh, M.", "Mezic, I."],
		"pubId": "ashhabsdm99b",
		"title": "Dynamical analysis and control of micro-cantilevers"
	}, {
		"abstract": "In this paper we use harmonic balance and averaging techniques to analyze the tapping mode dynamics of the atomic force microscope (AFM). A model for the cantilever sample interaction is developed. Experimental results show that the analysis and the model predict the behavior of the tapping cantilever.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/seb2000harmonic.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "1999",
		"pages": "232-236",
		"number": "",
		"volume": "",
		"journal": "American Control Conference,1999.",
		"author": ["Sebastian, A.", "Salapaka, M.V.", "Chen, D.J.", "Cleveland, J.P."],
		"pubId": "seb2000harmonic",
		"title": "Harmonic analysis based modeling of tapping-mode AFM"
	}, {
		"abstract": "This paper presents the identification and control of piezoelectric positioners used in atomic force microscopes (AFM) with the goal of improving probe positioning on the sample surface. A novel sensor was developed for this task and employed to infer a sixth order linear two input two output model of the piezos lateral dynamics. The piezo model was used to design a controller for tracking reference signals common in AFM operation. The controller and sensor were shown to significantly improve the microscopes ability to position the probe on the samples surface, enabling the AFM user to precisely scan areas on a surface based on images from previous scans.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/daniele1999piezoelectric.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "1999",
		"pages": "253-257",
		"number": "",
		"volume": "",
		"journal": "American Control Conference, 1999.",
		"author": ["Daniele, A.", "Salapaka, S.", "Salapaka, MV", "Dahleh, M."],
		"pubId": "daniele1999piezoelectric",
		"title": "Piezoelectric scanners for atomic force microscopes: Design of lateral sensors, identification and control"
	}, {
		"abstract": "We study the dynamical behavior of a microcantilever-sample system that forms the basis for the operation of atomic force microscopes (AFM). We model the microcantilever by a single mode approximation. The interaction between the sample and the cantilever is modeled by a Lennard�Jones potential which consists of a short-range repulsive potential and a long-range van der Waals (vdW) attractive potential. We analyze the dynamics of the cantilever sample system when the cantilever is subjected to a sinusoidal forcing. Using the Melnikov method, the region in the space of physical parameters where chaotic motion is present is determined. In addition, using a proportional and derivative controller, we compute the Melnikov function in terms of the parameters of the controller. Using this relation, controllers can be designed to selectively change the regime of dynamical interaction.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/melnikovBasedAnalysis.pdf",
		"type": "journal",
		"catid": "afm,chaos",
		"publisher": "",
		"year": "1999",
		"pages": "pp..197-220",
		"number": "",
		"volume": "20: (3)",
		"journal": "Nonlinear Dynamics",
		"author": ["Ashhab, M.", "Salapaka, M. V.", "Dahleh, M.", "Mezic, I."],
		"pubId": "ashhabsdm99a",
		"title": "Melnikov-based dynamical analysis of microcantilevers in scanning probe microscopy"
	}, {
		"abstract": "Stochastic resonance (SR) is an interesting phenomenon which can occur in bistable systems subject to both periodic and random forcing. This effect produces an improvement of the output signal-to-noise ratio when the input noise increases. In this paper we derive an expression for the power spectral density of a general class of systems revealing SR phenomena. This result may find useful applications in many technological contexts as, for example, in the analysis of the effects of thermal noise in atomic force microscopy, in order to optimize the achievable resolution for imaging",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/basso1999stochastic.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "IEEE",
		"year": "1999",
		"pages": "3774-3778",
		"number": "",
		"volume": "6",
		"journal": "American Control Conference (ACC), 1999",
		"author": ["Basso, M.", "Dahleh, M.", "MeziC, I.", "Salapaka, MV"],
		"pubId": "basso1999stochastic",
		"title": "Stochastic resonance in AFM's"
	}, {
		"abstract": "We consider controller design methods which can address directly the interplay between the H2 and l1 performance of the closed loop. The development is devoted to multi-input/multi-output (MIMO) systems. Two relevant multi-objective performance problems are considered each being of interest in its own right. In the first, termed as the combination problem, a weighted sum of the l1 norms and the square of the H2 norms of a given set of input-output transfer functions constituting the closed loop is minimized. It is shown that, in the one-block case, the solution can be obtained via a finite-dimensional quadratic optimization problem which has an a priori known dimension. In the four-block case, a method of computing approximate solutions within any a priori given tolerance is provided. In the second, termed as the mixed problem, the H2 performance of the closed loop is minimized subject to an l1 constraint. It is shown that approximating solutions within any a priori given tolerance can be obtained via the solution to a related combination problem",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/mimoContrlInterplayH2L1.pdf",
		"type": "journal",
		"catid": "control theory, multiobjective",
		"publisher": "IEEE",
		"year": "1998",
		"pages": "1374-1388",
		"number": "10",
		"volume": "43",
		"journal": "Automatic Control, IEEE Transactions on",
		"author": ["Salapaka, M.V.", "Dahleh, M.", "Voulgaris, P.G."],
		"pubId": "salapaka1998mimo",
		"title": "MIMO optimal control design: the interplay between the H2 and the l1 norms"
	}, {
		"abstract": "",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/missingLink.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "1998",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "Proceedings of the ASME conference, 1998",
		"author": ["M. V. Salapaka, M. Khammash,", "Dahleh, M."],
		"pubId": "mvrecentprogress",
		"title": "Recent progress in mixed objective control synthesis with l1 and H2 norms"
	}, {
		"abstract": "This paper solves the problem of synthesis of controllers achieving globally optimal robust performance against structured time-varying and/or nonlinear uncertainity. The performance measure considered is the infinity to infinity induced norm of a system's transfer function. The solution utilizes linear relaxation for finding the global optimal solution.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/khammash1998synthesis.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "1998",
		"pages": "3315-3320",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 1998. Proceedings of the 37th IEEE Conference on",
		"author": ["Salapaka, M.", "Khammash, M."],
		"pubId": "khammash1998synthesis",
		"title": "Synthesis of globally optimal controllers in l1 using linear relaxation"
	}, {
		"abstract": "In this paper, the most widely used mode of atomic force microscopy imaging where the cantilever is oscillated at its resonant frequency is studied. It is shown that the amplitude and the sine of the phase of the orbit vary linearly with respect to the cantilever-sample distance. Experiments conducted on a silicon cantilever agree with the theory developed.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/salapaka1998stability.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "1998",
		"pages": "2047-2052",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 1998. Proceedings of the 37th IEEE Conference on",
		"author": ["Salapaka, M.V.", "Chen, DJ", "Cleveland, J"],
		"pubId": "salapaka1998stability",
		"title": "Stability and sensitivity analysis of periodic orbits in tapping mode atomic force microscopy"
	}, {
		"abstract": "This work deals with a model for repeated impacts of a mass attached to a spring with a massive, sinusoidally vibrating table. This model has been studied in an attempt to understand the cantilever-sample dynamics in atomic force microscopy. In this work, we have shown that for some values of the frequency of the vibrating table, there are countably many orbits of arbitrarily long periods and the system is sensitive to the initial conditions with which the experiments are conducted.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/salapaka1998complex.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "1998",
		"pages": "2053-2058",
		"number": "",
		"volume": "",
		"journal": "Decision and Control, 1998. Proceedings of the 37th IEEE Conference on",
		"author": ["Salapaka, S.", "Salapaka, MV", "Dahleh, MA", "Mezic, I."],
		"pubId": "salapaka1998complex",
		"title": "Complex dynamics in repeated impact oscillators"
	}, {
		"abstract": "In this article optimal controller designs which address the concerns of the H2 and the l1 norms is studied. In the first problem a positive combination of the H2 and the l1 norms of the closed loop is minimized. In the second the l1 norm of a transfer function is minimized while restraining the H2 norm below a prespecified level. Converging upper and lower bounds are obtained. Relation to the pure l1 problem is established. The solution methodology does not involve zero interpolation to characterize the achievable closed-loop maps. Thus obtaining the controller from the optimal closed-loop map is straightforward.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/salapaka1999multi.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "1998",
		"pages": "660-664",
		"number": "",
		"volume": "",
		"journal": "American Control Conference (ACC), 1998l",
		"author": ["Salapaka, M.", "Khammash, M."],
		"pubId": "salapaka1999multi",
		"title": "Multi-objective MIMO optimal control design without zero interpolation"
	}, {
		"abstract": "We study the dynamical behaviour of a microcantilever-sample system that forms the basis for the operation of atomic force microscopes. We model the micro-cantilever by a single mode approximation and the interaction between the sample and cantilever by a van der Waals potential. The cantilever is vibrated by a sinusoidal input, and its deflection is detected optically. We analyze the forced dynamics using the Melnikov method, which reveals the region in the space of physical parameters where chaotic motion is possible. In addition, using a proportional and derivative controller we compute the Melnikov function in terms of the parameters of the controller. Using this relation it is possible to design controllers that will remove the possibility of chaos",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/ChaosAFM.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "1997",
		"pages": "196-202vol.1",
		"number": "",
		"volume": "1",
		"journal": "American Control Conference, 1997. Proceedings of the 1997",
		"author": ["Ashhab, M.", "Salapaka, M.V.", "Dahleh, M.", "Mezic, I."],
		"pubId": "chaosafm",
		"title": "Control of chaos in atomic force microscopes"
	}, {
		"abstract": "We consider the problem of minimizing a given positive linear combination of the l1 norm and the square of the H2 norm of the closed loop over all internally stabilizing controllers. The problem is analysed for the discrete-time, SISO, linear time-invariant case. It is shown that a unique optimal solution always exists, and can be obtained by solving a finite-dimensional convex optimization problem with an a priori determined dimension. It is also established that the solution is continuous with respect to changes in the coefficients of the linear combination.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/sisol1h2Comb.pdf",
		"type": "journal",
		"catid": "control theory, multiobjective",
		"publisher": "Elsevier",
		"year": "1997",
		"pages": "387-391",
		"number": "3",
		"volume": "33",
		"journal": "Automatica",
		"author": ["Salapaka, M.V.", "Voulgaris, P.", "Dahleh, M."],
		"pubId": "salapaka1997siso",
		"title": "SISO controller design to minimize a positive combination of the l1 and the H2 norms"
	}, {
		"abstract": "In this paper we consider the problem of minimizing the l1 norm of the transfer function from the exogenous input to the regulated output over all internally stabilizing controllers while keeping its H2 norm under a specified level. The problem is analyzed for the discrete-time, single-input single-output (SISO), linear-time invariant case. It is shown that an optimal solution always exists. Duality theory is employed to show that any optimal solution is a finite impulse response sequence, and an a priori bound is given on its length. Thus, the problem can be reduced to a finite-dimensional convex optimization problem with an a priori determined dimension. Finally, it is shown that, in the region of interest of the H2 constraint level, the optimal is unique and continuous with respect to changes in the constraint level.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/MixedObjectiveControlSynthesis.pdf",
		"type": "journal",
		"catid": "control theory,multiobjective",
		"publisher": "Society for Industrial and Applied Mathematics, 1976-",
		"year": "1997",
		"pages": "1672-1689",
		"number": "5",
		"volume": "35",
		"journal": "SIAM journal on control and optimization",
		"author": ["Salapaka, M.V.", "Dahleh, M.", "Voulgaris, P."],
		"pubId": "salapaka1997mixed",
		"title": "Mixed Objective Control Synthesis: Optimal l1/H2 Control"
	}, {
		"abstract": "",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/missingLink.pdf",
		"type": "conference",
		"catid": "afm",
		"publisher": "",
		"year": "1997",
		"pages": "25-27",
		"number": "",
		"volume": "",
		"journal": "Proc. IFAC Symp. Robust Control Design",
		"author": ["Daniele, A.", "Nakata, T.", "Giarre, L.", "Salapaka, MV", "Dahleh, M."],
		"pubId": "daniele1997robust",
		"title": "Robust identification and control of scanning probe microscope scanner"
	}, {
		"abstract": "",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/missingLink.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "1997",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "Proceedings of the Allerton Conference, Urbana, Illinois, 1997",
		"author": ["Salapaka, M. V.", "Dahleh, M."],
		"pubId": "mvl1h2",
		"title": "l1/H2 control"
	}, {
		"abstract": "A multi-mode analysis of micro-cantilever dynamics is presented. We derive the power spectral density of the cantilever displacement due to a thermal noise source and predict the cantilevers�s fundamental resonant frequency and higher harmonics. The first mode in the multi-mode model is equivalent to the traditional single-mode model. Experimental results obtained with a silicon nitride cantilever at 300 K are in excellent qualitative agreement with the multi-mode model. The multi-mode model may be used to obtain accurate values of the cantilever properties such as the elastic modulus, effective mass, thickness and moment of inertia.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/thermallyDrivNcAFM.pdf",
		"type": "journal",
		"catid": "afm,thermal noise",
		"publisher": "",
		"year": "1997",
		"pages": "2480",
		"number": "6",
		"volume": "81",
		"journal": "JAP",
		"author": ["Salapaka, M. V.", "Bergh, H. S.", "Lai, J.", "Majumdar, A.", "McFarland, E."],
		"pubId": "salapakablmm97",
		"title": "Multi-mode noise analysis of cantilevers for scanning probe microscopy"
	}, {
		"abstract": "We formulate a problem which incorporates nominal H2 performance and robust l1 performance in the presence of a scalar perturbation. It is shown that this problem can be solved via a sequence of finite dimensional quadratic programming problems",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/H2andL1Performance.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "1996",
		"pages": "4034-4039vol.4",
		"number": "",
		"volume": "4",
		"journal": "Decision and Control, 1996., Proceedings of the 35th IEEE",
		"author": ["Salapaka, M.V.", "Dahleh, M.", "Vicino, A.", "Tesi, A."],
		"pubId": "h2andl1performance",
		"title": "Nominal H2 performance and l1 robust performance"
	}, {
		"abstract": "This paper studies a mixed objective problem of minimizing l-infinity, l2, and l1-norms together with the l-infinity norm of the step response of the closed loop. This performance index can be used to generate Pareto-optimal solutions with respect to the individual measures. The problem is analyzed for discrete-time, singleinput single-output (SISO), linear time-invariant systems. It is shown via Lagrange duality theory that the problem can be reduced to a convex optimization problem with a priori known dimension. In addition, continuity of the unique optimal solution with respect to changes in the coefficients of the linear combination that defines the performance measure is established.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/compPerfJOTA.pdf",
		"type": "journal",
		"catid": "control theory, multiobjective",
		"publisher": "Springer",
		"year": "1996",
		"pages": "91-113",
		"number": "1",
		"volume": "91",
		"journal": "Journal of optimization theory and applications",
		"author": ["Salapaka, M.V.", "Voulgaris, PG", "Dahleh, M."],
		"pubId": "salapakajota1996",
		"title": "Controller design to optimize a composite performance measure"
	}, {
		"abstract": "In this paper we analyze the controllability of quantum systems arising in molecular dynamics. We model these systems as systems with finite numbers of levels, and examine their controllability. To do this we pass to their unitary generators and use results on the controllability of invariant systems on Lie groups. Examples of molecular systems, modeled as finite-dimensional control systems, are provided. A simple algorithm to detect the controllability of a molecular system is provided. Finally, we apply this algorithm to a five-level system.",
		"highlights": "journalArticles/missingLink.pdf",
		"pdflink": "journalArticles/molecularSystems.pdf",
		"type": "journal",
		"catid": "quantum mechanics,theory",
		"publisher": "APS",
		"year": "1995",
		"pages": "960",
		"number": "2",
		"volume": "51",
		"journal": "Physical Review A",
		"author": ["Ramakrishna, V.", "Salapaka, M.V.", "Dahleh, M.", "Rabitz, H.", "Peirce, A."],
		"pubId": "ramakrishna1995controllability",
		"title": "Controllability of molecular systems"
	}, {
		"abstract": "In this paper we consider the problem of minimizing the l1 norm of the transfer function from the exogenous input to the regulated output over all internally stabilizing controllers while keeping its H2 norm under a specified level. The problem is analysed for the discrete-time, SISO, linear time invariant case. It is shown that an optimal solution always exists. Duality theory is employed to show that any optimal solution is a finite impulse response sequence and an a priori bound is given on its length. The problem is reduced to a finite dimensional convex optimization problem with an a priori determined dimension. Finally it is shown that, in the region of interest of the H2 constraint level the optimal is unique and continuous with respect to changes in the constraint level",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/MixedObjectiveControlSynthesis.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "1995",
		"pages": "1438-1442vol.2",
		"number": "",
		"volume": "2",
		"journal": "American Control Conference, 1995. Proceedings of the",
		"author": ["Salapaka, M.V.", "Dahleh, M.", "Voulgaris, P."],
		"pubId": "mixedobjectivecontrolsynthesis",
		"title": "Mixed objective control synthesis: optimal l1/ H2 control"
	}, {
		"abstract": "",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/missingLink.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "1995",
		"pages": "93-100",
		"number": "",
		"volume": "2",
		"journal": "Proceedings of the third Mediterranean Symposium on New Directions in Control and Automation, 1995",
		"author": ["M. V. Salapaka, P. Voulgaris", "Dahleh, M."],
		"pubId": "mvcontrollerdesign",
		"title": "Controller design to minimize a composite measure of the l1 and the H2 norms"
	}, {
		"abstract": "We consider the problem of minimizing the H2 performance of the closed loop subject to a l1 constraint. The development is devoted to multi-input multi-output (MIMO) systems. It is shown that approximating solutions to the optimal within any a priori given tolerance can be obtained via a finite dimensional quadratic optimization problem whose dimension is known a priori",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/H2andL1Norms.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "1995",
		"pages": "3682-3687vol.4",
		"number": "",
		"volume": "4",
		"journal": "Decision and Control, 1995., Proceedings of the 34th IEEE Conference on",
		"author": ["Salapaka, M.V.", "Dahleh, M.", "Voulgaris, P."],
		"pubId": "h2andl1norms",
		"title": "MIMO optimal control design: the interplay of the H2 and the l1 norms"
	}, {
		"abstract": "Directed transport of intracellular cargo is predominantly carried out by nanoscale bio-mechanical agents called molecular motor proteins. Often, multiple motors with same or different mechano-chemical properties team up to transport cargoes inside cells. In this article we analyze the behavior of homogeneous multi-motor ensembles and prove the existence of a transient state in the state space describing the various configurations for a two-motor ensemble. We further show that the various motor configurations for such an ensemble have a unique steady state probability distribution, implying that such a system possesses a degree of robustness. Results of this nature can be extended to ensembles containing higher number of motors, with the associated steady state distributions providing insights into possible mechanisms employed by motors while transporting a common cargo.",
		"highlights": "conferenceArticles/missingLink.pdf",
		"pdflink": "conferenceArticles/talukdarsteady.pdf",
		"type": "conference",
		"catid": "theory",
		"publisher": "",
		"year": "",
		"pages": "",
		"number": "",
		"volume": "",
		"journal": "",
		"author": ["Talukdar, Saurav", "Bhaban, Shreyas", "Salapaka, Murti"],
		"pubId": "talukdarsteady",
		"title": "Steady State Distribution of Molecular Motor Ensembles"
	}
]